{
    "personalities": [
      {
        "id": 1,
        "language_code": "en",
        "type": "INTJ",
        "name": "The Architect",
        "Description": "Architects are strategic masterminds who excel in solving complex problems. Known for their independence, logical thinking, and high standards, they are driven by the pursuit of knowledge. Often misunderstood for their aloofness, they value intellectual stimulation and thrive in environments that challenge their creativity and efficiency. Relationships, for Architects, are built on trust, honesty, and shared visions for the future.",
        "Strengths": [
          "Quick-minded",
          "Imaginative",
          "Strategic",
          "Confident",
          "Independent",
          "Decisive",
          "Hard-working",
          "Determined",
          "Open-minded",
          "Jack-of-all-trades",
          "Innovative",
          "Loyal"
        ],
        "Weaknesses": [
          "Arrogant",
          "Judgmental",
          "Overly analytical",
          "Loath structured environments",
          "Clueless in romance",
          "Superiority complex",
          "Emotionally distant"
        ],
        "DosInRelationship": [
          "Be honest, authentic, and intellectually stimulating.",
          "Compliment their ideas and accomplishments.",
          "Help them have fun and unwind outside their structured world.",
          "Show consistent reliability and dependability."
        ],
        "DontsInRelationship": [
          "Don’t push them to socialize too much.",
          "Avoid pressuring them to talk about feelings early in the relationship.",
          "Don’t be passive-aggressive or overly emotional.",
          "Don’t be late—they value punctuality and direct communication."
        ],
        "Friendships": "Architects are known for their independence and wit. They know exactly who they are and who they want to surround themselves with. Masterminds would rather be right than popular, and while they may not be everyone's cup of tea, they have a charm that wins over those who understand them. Keeping their circle small but meaningful matters more to them than having superficial connections. In the end, Architects cherish friends with whom they can discuss anything under the sun, enjoying deep, intellectual discussions.",
        "CareerPath": [
          "Anesthesiologist",
          "Biochemist",
          "Biologist",
          "Chemical Engineer",
          "Computer Programmer",
          "Electronics Engineer",
          "Industrial Engineer",
          "Information Security Analyst",
          "Lawyer",
          "Surgeon"
        ],
        "LifeValue": [
          "Health",
          "Home/Family",
          "Achievement",
          "Autonomy",
          "Financial Security"
        ],
        "CompatibleConnections": [
          "The Commander (ENTJ)",
          "The Debater (ENTP)",
          "The Campaigner (ENFP)"
        ],
        "HasPotentialConnections": [
          "The Thinker (INTP)",
          "The Protagonist (ENFJ)",
          "The Advocate (INFJ)",
          "The Mediator (INFP)",
          "The Dynamo (ESTP)"
        ],
        "ChallengingConnections": [
          "The Architect (INTJ)",
          "The Adventurer (ISFP)",
          "The Consul (ESFJ)",
          "The Virtuoso (ISTP)",
          "The Executive (ESTJ)",
          "The Defender (ISFJ)",
          "The Logistician (ISTJ)",
          "The Performer (ESFP)"
        ],
        "AttractedBy": [
          "Sincere",
          "Rational",
          "Punctual",
          "Respectful",
          "Open",
          "Welcoming",
          "Loyal",
          "Authentic",
          "Curious",
          "Romantic",
          "Thoughtful"
        ],
        "PetPeeves": [
          "Controlling",
          "Irrational",
          "Illogical",
          "Overly emotional",
          "Passive-aggressive",
          "Insincere",
          "Superficial",
          "Disloyal",
          "Untrustworthy",
          "Unintelligent",
          "Manipulative"
        ],
        "HowToBeCompanion": [
          "Respect their need for solitude and time to think—they recharge in private.",
          "Be intellectually stimulating; they appreciate deep, thought-provoking conversations.",
          "Value logic and reason in your discussions—they prefer rationality over emotional outbursts.",
          "Support their long-term goals and vision for the future.",
          "Be straightforward and honest—they dislike mind games or manipulation.",
          "Give them space to work independently, but show loyalty and commitment."
        ],
        "SecretDesire": "Architects are highly analytical and often lost in their thoughts, which makes them feel disconnected from the present. Their secret desire is to enjoy life’s simple pleasures without overthinking. They wish to escape their minds, indulge in spontaneity, and find balance between their intellectual and emotional sides. Although they may occasionally become reckless, they learn to better manage this divide with time.",
        "Stereotypes": "Architects are often stereotyped as cold, aloof, and robotic due to their analytical nature.",
        "Celebrities": [
          "Pharaoh Imhotep",
          "Elon Musk",
          "Tiger Woods",
          "Cheikh Anta Diop",
          "Thierry Henry",
          "Shaka Zulu",
          "W.E.B. Du Bois",
          "Mansa Abu Bakr II",
          "Mark Zuckerberg",
          "Stephen Hawking",
          "Nikola Tesla"
        ]
      },
      {
        "id": 1,
        "language_code": "fr",
        "type": "INTJ",
        "name": "L'Architecte",
        "Description": "Les Architectes sont des stratèges qui excellent dans la résolution de problèmes complexes. Connus pour leur indépendance, leur pensée logique et leurs normes élevées, ils sont motivés par la quête de la connaissance. Souvent mal compris à cause de leur distance apparente, ils apprécient la stimulation intellectuelle et prospèrent dans des environnements qui défient leur créativité et leur efficacité. Pour les Architectes, les relations sont fondées sur la confiance, l'honnêteté et des visions partagées de l'avenir.",
        "Strengths": [
          "Esprit vif",
          "Imaginatif",
          "Stratégique",
          "Confiant",
          "Indépendant",
          "Décisif",
          "Travailleur",
          "Déterminé",
          "Ouvert d'esprit",
          "Polyvalent",
          "Innovant",
          "Loyal"
        ],
        "Weaknesses": [
          "Arrogant",
          "Critique",
          "Trop analytique",
          "Déteste les environnements structurés",
          "Maladroit en romance",
          "Complexe de supériorité",
          "Distant émotionnellement"
        ],
        "DosInRelationship": [
          "Soyez honnête, authentique et stimulant intellectuellement.",
          "Complimentez leurs idées et leurs réalisations.",
          "Aidez-les à s'amuser et à se détendre en dehors de leur monde structuré.",
          "Montrez une fiabilité et une constance dans vos actions."
        ],
        "DontsInRelationship": [
          "Ne les poussez pas à trop socialiser.",
          "Évitez de les presser à parler de leurs sentiments au début de la relation.",
          "Ne soyez pas passif-agressif ou trop émotionnel.",
          "Ne soyez pas en retard - ils apprécient la ponctualité et la communication directe."
        ],
        "Friendships": "Les Architectes sont connus pour leur indépendance et leur esprit vif. Ils savent exactement qui ils sont et qui ils veulent avoir autour d'eux. Les stratèges préfèrent avoir raison plutôt que d'être populaires, et bien qu'ils ne soient pas au goût de tout le monde, ils ont un charme qui conquiert ceux qui les comprennent. Garder leur cercle petit mais significatif compte plus pour eux que d'avoir des relations superficielles. En fin de compte, les Architectes chérissent les amis avec qui ils peuvent discuter de tout, en appréciant des discussions intellectuelles profondes.",
        "CareerPath": [
          "Anesthésiste",
          "Biochimiste",
          "Biologiste",
          "Ingénieur chimiste",
          "Programmeur informatique",
          "Ingénieur en électronique",
          "Ingénieur industriel",
          "Analyste en sécurité de l'information",
          "Avocat",
          "Chirurgien"
        ],
        "LifeValue": [
          "Santé",
          "Maison/Famille",
          "Réussite",
          "Autonomie",
          "Sécurité financière"
        ],
        "CompatibleConnections": [
          "Le Commandant (ENTJ)",
          "Le Débatteur (ENTP)",
          "Le Campagneur (ENFP)"
        ],
        "HasPotentialConnections": [
          "Le Penseur (INTP)",
          "Le Protagoniste (ENFJ)",
          "L'Avocat (INFJ)",
          "Le Médiateur (INFP)",
          "Le Dynamique (ESTP)"
        ],
        "ChallengingConnections": [
          "L'Architecte (INTJ)",
          "L'Aventurier (ISFP)",
          "Le Consul (ESFJ)",
          "Le Virtuose (ISTP)",
          "L'Exécutif (ESTJ)",
          "Le Défenseur (ISFJ)",
          "Le Logicien (ISTJ)",
          "Le Performeur (ESFP)"
        ],
        "AttractedBy": [
          "Sincère",
          "Rationnel",
          "Ponctuel",
          "Respectueux",
          "Ouvert",
          "Accueillant",
          "Loyal",
          "Authentique",
          "Curieux",
          "Romantique",
          "Attentionné"
        ],
        "PetPeeves": [
          "Contrôlant",
          "Irrationnel",
          "Illogique",
          "Trop émotionnel",
          "Passif-agressif",
          "Insincère",
          "Superficiel",
          "Déloyal",
          "Indigne de confiance",
          "Peu intelligent",
          "Manipulateur"
        ],
        "HowToBeCompanion": [
          "Respectez leur besoin de solitude et de temps pour réfléchir - ils se ressourcent en privé.",
          "Soyez stimulant intellectuellement; ils apprécient les conversations profondes et provocantes.",
          "Appréciez la logique et la raison dans vos discussions - ils préfèrent la rationalité aux débordements émotionnels.",
          "Soutenez leurs objectifs à long terme et leur vision pour l'avenir.",
          "Soyez direct et honnête - ils n'aiment pas les jeux d'esprit ou la manipulation.",
          "Donnez-leur de l'espace pour travailler de manière indépendante, mais montrez de la loyauté et de l'engagement."
        ],
        "SecretDesire": "Les Architectes sont très analytiques et souvent perdus dans leurs pensées, ce qui les fait se sentir déconnectés du présent. Leur désir secret est de profiter des plaisirs simples de la vie sans trop réfléchir. Ils souhaitent s'échapper de leurs pensées, se laisser aller à la spontanéité, et trouver un équilibre entre leur côté intellectuel et émotionnel. Bien qu'ils puissent parfois devenir imprudents, ils apprennent à mieux gérer cette division avec le temps.",
        "Stereotypes": "Les Architectes sont souvent stéréotypés comme étant froids, distants et robotiques en raison de leur nature analytique.",
        "Celebrities": [
          "Pharaon Imhotep",
          "Elon Musk",
          "Tiger Woods",
          "Cheikh Anta Diop",
          "Thierry Henry",
          "Shaka Zulu",
          "W.E.B. Du Bois",
          "Mansa Abu Bakr II",
          "Mark Zuckerberg",
          "Stephen Hawking",
          "Nikola Tesla"
        ]
      },
      {
        "id": 1,
        "language_code": "es",
        "type": "INTJ",
        "name": "El Arquitecto",
        "Description": "Los Arquitectos son maestros estratégicos que sobresalen en resolver problemas complejos. Conocidos por su independencia, pensamiento lógico y altos estándares, están impulsados por la búsqueda del conocimiento. A menudo malentendidos por su frialdad, valoran la estimulación intelectual y prosperan en entornos que desafían su creatividad y eficiencia. Para los Arquitectos, las relaciones se basan en la confianza, la honestidad y visiones compartidas para el futuro.",
        "Strengths": [
          "Ágil mentalmente",
          "Imaginativo",
          "Estratégico",
          "Seguro de sí mismo",
          "Independiente",
          "Decisivo",
          "Trabajador",
          "Determinado",
          "De mente abierta",
          "Polifacético",
          "Innovador",
          "Leal"
        ],
        "Weaknesses": [
          "Arrogante",
          "Crítico",
          "Demasiado analítico",
          "Detestan entornos estructurados",
          "Torpes en el romance",
          "Complejo de superioridad",
          "Distante emocionalmente"
        ],
        "DosInRelationship": [
          "Sé honesto, auténtico y estimulante intelectualmente.",
          "Elogia sus ideas y logros.",
          "Ayúdalos a divertirse y relajarse fuera de su mundo estructurado.",
          "Muestra consistencia y fiabilidad."
        ],
        "DontsInRelationship": [
          "No los empujes a socializar demasiado.",
          "Evita presionarlos para hablar de sentimientos al principio de la relación.",
          "No seas pasivo-agresivo o demasiado emocional.",
          "No llegues tarde; valoran la puntualidad y la comunicación directa."
        ],
        "Friendships": "Los Arquitectos son conocidos por su independencia e ingenio. Saben exactamente quiénes son y con quién quieren rodearse. Los estrategas prefieren tener razón que ser populares, y aunque no sean del agrado de todos, tienen un encanto que conquista a aquellos que los entienden. Mantener su círculo pequeño pero significativo les importa más que tener conexiones superficiales. Al final, los Arquitectos aprecian amigos con los que pueden hablar de cualquier cosa, disfrutando de conversaciones profundas e intelectuales.",
        "CareerPath": [
          "Anestesiólogo",
          "Bioquímico",
          "Biólogo",
          "Ingeniero químico",
          "Programador informático",
          "Ingeniero electrónico",
          "Ingeniero industrial",
          "Analista de seguridad informática",
          "Abogado",
          "Cirujano"
        ],
        "LifeValue": [
          "Salud",
          "Hogar/Familia",
          "Logro",
          "Autonomía",
          "Seguridad financiera"
        ],
        "CompatibleConnections": [
          "El Comandante (ENTJ)",
          "El Debatidor (ENTP)",
          "El Campañero (ENFP)"
        ],
        "HasPotentialConnections": [
          "El Pensador (INTP)",
          "El Protagonista (ENFJ)",
          "El Abogado (INFJ)",
          "El Mediador (INFP)",
          "El Dinámico (ESTP)"
        ],
        "ChallengingConnections": [
          "El Arquitecto (INTJ)",
          "El Aventurero (ISFP)",
          "El Cónsul (ESFJ)",
          "El Virtuoso (ISTP)",
          "El Ejecutivo (ESTJ)",
          "El Defensor (ISFJ)",
          "El Logístico (ISTJ)",
          "El Intérprete (ESFP)"
        ],
        "AttractedBy": [
          "Sincero",
          "Racional",
          "Puntual",
          "Respetuoso",
          "Abierto",
          "Acogedor",
          "Leal",
          "Auténtico",
          "Curioso",
          "Romántico",
          "Considerado"
        ],
        "PetPeeves": [
          "Controlador",
          "Irracional",
          "Ilógico",
          "Demasiado emocional",
          "Pasivo-agresivo",
          "Insincero",
          "Superficial",
          "Desleal",
          "No confiable",
          "Poco inteligente",
          "Manipulador"
        ],
        "HowToBeCompanion": [
          "Respeta su necesidad de soledad y tiempo para pensar: recargan energías en privado.",
          "Sé estimulante intelectualmente; aprecian conversaciones profundas y reflexivas.",
          "Valora la lógica y la razón en tus discusiones; prefieren la racionalidad a los arrebatos emocionales.",
          "Apoya sus metas a largo plazo y su visión para el futuro.",
          "Sé directo y honesto; no les gustan los juegos mentales o la manipulación.",
          "Dales espacio para trabajar de forma independiente, pero muestra lealtad y compromiso."
        ],
        "SecretDesire": "Los Arquitectos son muy analíticos y a menudo se pierden en sus pensamientos, lo que los hace sentir desconectados del presente. Su deseo secreto es disfrutar de los placeres simples de la vida sin pensar demasiado. Desean escapar de sus mentes, entregarse a la espontaneidad y encontrar el equilibrio entre su lado intelectual y emocional. Aunque a veces pueden volverse imprudentes, aprenden a gestionar mejor esta división con el tiempo.",
        "Stereotypes": "Los Arquitectos a menudo son estereotipados como fríos, distantes y robóticos debido a su naturaleza analítica.",
        "Celebrities": [
          "Faraón Imhotep",
          "Elon Musk",
          "Tiger Woods",
          "Cheikh Anta Diop",
          "Thierry Henry",
          "Shaka Zulu",
          "W.E.B. Du Bois",
          "Mansa Abu Bakr II",
          "Mark Zuckerberg",
          "Stephen Hawking",
          "Nikola Tesla"
        ]
      },
      {
        "id": 1,
        "language_code": "pt",
        "type": "INTJ",
        "name": "O Arquiteto",
        "Description": "Os Arquitetos são mestres estratégicos que se destacam na resolução de problemas complexos. Conhecidos por sua independência, pensamento lógico e altos padrões, são movidos pela busca do conhecimento. Frequentemente incompreendidos por sua frieza, valorizam a estimulação intelectual e prosperam em ambientes que desafiam sua criatividade e eficiência. Para os Arquitetos, os relacionamentos são construídos com base na confiança, honestidade e visões compartilhadas para o futuro.",
        "Strengths": [
          "Rápido de raciocínio",
          "Imaginativo",
          "Estratégico",
          "Confiante",
          "Independente",
          "Decisivo",
          "Trabalhador",
          "Determinado",
          "De mente aberta",
          "Polivalente",
          "Inovador",
          "Leal"
        ],
        "Weaknesses": [
          "Arrogante",
          "Crítico",
          "Excessivamente analítico",
          "Detesta ambientes estruturados",
          "Desajeitado no romance",
          "Complexo de superioridade",
          "Distante emocionalmente"
        ],
        "DosInRelationship": [
          "Seja honesto, autêntico e intelectualmente estimulante.",
          "Elogie suas ideias e realizações.",
          "Ajude-os a se divertir e relaxar fora de seu mundo estruturado.",
          "Mostre consistência e confiabilidade."
        ],
        "DontsInRelationship": [
          "Não os force a socializar muito.",
          "Evite pressioná-los a falar sobre sentimentos no início do relacionamento.",
          "Não seja passivo-agressivo ou excessivamente emocional.",
          "Não se atrase – eles valorizam a pontualidade e a comunicação direta."
        ],
        "Friendships": "Os Arquitetos são conhecidos por sua independência e sagacidade. Sabem exatamente quem são e com quem querem se cercar. Os estrategistas preferem estar certos a serem populares, e embora possam não ser do agrado de todos, têm um charme que conquista aqueles que os entendem. Manter seu círculo pequeno, mas significativo, é mais importante para eles do que ter conexões superficiais. No final, os Arquitetos apreciam amigos com quem possam conversar sobre qualquer coisa, desfrutando de discussões intelectuais profundas.",
        "CareerPath": [
          "Anestesista",
          "Bioquímico",
          "Biólogo",
          "Engenheiro químico",
          "Programador de computadores",
          "Engenheiro eletrónico",
          "Engenheiro industrial",
          "Analista de segurança da informação",
          "Advogado",
          "Cirurgião"
        ],
        "LifeValue": [
          "Saúde",
          "Lar/Família",
          "Realização",
          "Autonomia",
          "Segurança financeira"
        ],
        "CompatibleConnections": [
          "O Comandante (ENTJ)",
          "O Debatedor (ENTP)",
          "O Campanha (ENFP)"
        ],
        "HasPotentialConnections": [
          "O Pensador (INTP)",
          "O Protagonista (ENFJ)",
          "O Advogado (INFJ)",
          "O Mediador (INFP)",
          "O Dinâmico (ESTP)"
        ],
        "ChallengingConnections": [
          "O Arquiteto (INTJ)",
          "O Aventureiro (ISFP)",
          "O Cônsul (ESFJ)",
          "O Virtuoso (ISTP)",
          "O Executivo (ESTJ)",
          "O Defensor (ISFJ)",
          "O Lógico (ISTJ)",
          "O Performador (ESFP)"
        ],
        "AttractedBy": [
          "Sincero",
          "Racional",
          "Pontual",
          "Respeitoso",
          "Aberto",
          "Acolhedor",
          "Leal",
          "Autêntico",
          "Curioso",
          "Romântico",
          "Atencioso"
        ],
        "PetPeeves": [
          "Controlador",
          "Irracional",
          "Ilógico",
          "Excessivamente emocional",
          "Passivo-agressivo",
          "Insincero",
          "Superficial",
          "Desleal",
          "Indigno de confiança",
          "Pouco inteligente",
          "Manipulador"
        ],
        "HowToBeCompanion": [
          "Respeite sua necessidade de solidão e tempo para pensar - eles recarregam as energias em particular.",
          "Seja intelectualmente estimulante; eles apreciam conversas profundas e reflexivas.",
          "Valorize a lógica e a razão em suas discussões; eles preferem a racionalidade a explosões emocionais.",
          "Apoie seus objetivos de longo prazo e sua visão para o futuro.",
          "Seja direto e honesto – eles não gostam de joguinhos ou manipulações.",
          "Dê-lhes espaço para trabalhar de forma independente, mas mostre lealdade e comprometimento."
        ],
        "SecretDesire": "Os Arquitetos são altamente analíticos e muitas vezes perdidos em seus pensamentos, o que os faz sentir-se desconectados do presente. Seu desejo secreto é desfrutar dos prazeres simples da vida sem pensar demais. Eles desejam escapar de suas mentes, entregar-se à espontaneidade e encontrar equilíbrio entre seu lado intelectual e emocional. Embora possam ocasionalmente se tornar imprudentes, aprendem a gerenciar melhor essa divisão com o tempo.",
        "Stereotypes": "Os Arquitetos são frequentemente estereotipados como frios, distantes e robóticos devido à sua natureza analítica.",
        "Celebrities": [
          "Faraó Imhotep",
          "Elon Musk",
          "Tiger Woods",
          "Cheikh Anta Diop",
          "Thierry Henry",
          "Shaka Zulu",
          "W.E.B. Du Bois",
          "Mansa Abu Bakr II",
          "Mark Zuckerberg",
          "Stephen Hawking",
          "Nikola Tesla"
        ]
      },
      {
        "id": 1,
        "language_code": "ar",
        "type": "INTJ",
        "name": "المهندس المعماري",
        "Description": "المهندسون المعماريون هم استراتيجيون بارعون يتفوقون في حل المشكلات المعقدة. معروفون باستقلالهم وتفكيرهم المنطقي ومعاييرهم العالية، وهم مدفوعون بالسعي وراء المعرفة. غالبًا ما يساء فهمهم بسبب برودتهم، لكنهم يقدرون التحفيز الفكري ويزدهرون في البيئات التي تتحدى إبداعهم وكفاءتهم. بالنسبة للمهندسين المعماريين، تُبنى العلاقات على الثقة والصدق والرؤى المشتركة للمستقبل.",
        "Strengths": [
          "سريع البديهة",
          "خيالي",
          "استراتيجي",
          "واثق",
          "مستقل",
          "حاسم",
          "مجتهد",
          "مصمم",
          "منفتح الذهن",
          "متعدد المواهب",
          "مبتكر",
          "وفي"
        ],
        "Weaknesses": [
          "متعجرف",
          "انتقادي",
          "مفرط في التحليل",
          "يكره البيئات المنظمة",
          "عديم الخبرة في الرومانسية",
          "معقد بسبب شعور التفوق",
          "بعيد عاطفياً"
        ],
        "DosInRelationship": [
          "كن صادقًا، أصيلًا، ومحفزًا فكريًا.",
          "أثن على أفكارهم وإنجازاتهم.",
          "ساعدهم على الاستمتاع والاسترخاء خارج عالمهم المنظم.",
          "أظهر الموثوقية والاعتمادية المستمرة."
        ],
        "DontsInRelationship": [
          "لا تدفعهم إلى التواصل الاجتماعي بشكل مفرط.",
          "تجنب الضغط عليهم للحديث عن المشاعر في وقت مبكر من العلاقة.",
          "لا تكن عدوانيًا بشكل غير مباشر أو مفرط في العواطف.",
          "لا تتأخر - فهم يقدرون الالتزام بالمواعيد والتواصل المباشر."
        ],
        "Friendships": "المهندسون المعماريون معروفون باستقلاليتهم وذكائهم. يعرفون بالضبط من هم ومن يريدون أن يكونوا حولهم. يفضل المهندسون أن يكونوا على حق بدلاً من أن يكونوا شعبيين، وعلى الرغم من أنهم قد لا يكونون على مزاج الجميع، إلا أنهم يمتلكون سحرًا يجذب أولئك الذين يفهمونهم. يهمهم أكثر الحفاظ على دائرة صغيرة لكن ذات معنى بدلاً من وجود اتصالات سطحية. في النهاية، يقدر المهندسون الأصدقاء الذين يمكنهم مناقشة أي شيء معهم، مستمتعين بالنقاشات الفكرية العميقة.",
        "CareerPath": [
          "طبيب تخدير",
          "كيميائي حيوي",
          "عالم أحياء",
          "مهندس كيميائي",
          "مبرمج حاسوب",
          "مهندس إلكترونيات",
          "مهندس صناعي",
          "محلل أمن المعلومات",
          "محامي",
          "جراح"
        ],
        "LifeValue": [
          "الصحة",
          "المنزل/العائلة",
          "الإنجاز",
          "الاستقلالية",
          "الأمان المالي"
        ],
        "CompatibleConnections": [
          "القائد (ENTJ)",
          "المناظر (ENTP)",
          "المحاور (ENFP)"
        ],
        "HasPotentialConnections": [
          "المفكر (INTP)",
          "البطل (ENFJ)",
          "المحامي (INFJ)",
          "الوسيط (INFP)",
          "الدينامو (ESTP)"
        ],
        "ChallengingConnections": [
          "المهندس المعماري (INTJ)",
          "المغامر (ISFP)",
          "القنصل (ESFJ)",
          "المبدع (ISTP)",
          "المدير التنفيذي (ESTJ)",
          "المدافع (ISFJ)",
          "المنطقي (ISTJ)",
          "المؤدي (ESFP)"
        ],
        "AttractedBy": [
          "صادق",
          "عقلاني",
          "ملتزم بالمواعيد",
          "محترم",
          "منفتح",
          "مرحِّب",
          "وفي",
          "أصيل",
          "فضولي",
          "رومانسي",
          "مفكر"
        ],
        "PetPeeves": [
          "متحكم",
          "غير عقلاني",
          "غير منطقي",
          "مفرط في العواطف",
          "عدواني بشكل غير مباشر",
          "غير صادق",
          "سطحي",
          "غير وفي",
          "غير جدير بالثقة",
          "غير ذكي",
          "مناور"
        ],
        "HowToBeCompanion": [
          "احترم حاجتهم للوحدة والوقت للتفكير - هم يستعيدون طاقاتهم في العزلة.",
          "كن محفزًا فكريًا؛ يقدرون المحادثات العميقة والمثيرة للتفكير.",
          "قدر المنطق والعقلانية في مناقشاتك؛ يفضلون التفكير العقلاني على الانفعالات العاطفية.",
          "ادعم أهدافهم طويلة المدى ورؤيتهم للمستقبل.",
          "كن صريحًا وصادقًا - فهم لا يحبون الألعاب الذهنية أو التلاعب.",
          "امنحهم مساحة للعمل بشكل مستقل، ولكن أظهر لهم الولاء والالتزام."
        ],
        "SecretDesire": "المهندسون المعماريون هم محللون عميقون وغالبًا ما يغرقون في أفكارهم، مما يجعلهم يشعرون بالانفصال عن الحاضر. رغبتهم السرية هي الاستمتاع بالمتع البسيطة في الحياة دون الإفراط في التفكير. يتمنون الهروب من عقولهم، والانغماس في العفوية، والعثور على التوازن بين جوانبهم الفكرية والعاطفية. وعلى الرغم من أنهم قد يصبحون متهورين أحيانًا، إلا أنهم يتعلمون إدارة هذه الفجوة بشكل أفضل مع مرور الوقت.",
        "Stereotypes": "غالبًا ما يُنظر إلى المهندسين المعماريين على أنهم باردون ومنعزلون وروبوتيون بسبب طبيعتهم التحليلية.",
        "Celebrities": [
          "فرعون إمحوتب",
          "إيلون ماسك",
          "تايجر وودز",
          "شيخ أنتا ديوب",
          "تييري هنري",
          "شاكا زولو",
          "دبليو. إي. بي. دو بوا",
          "مانسا أبو بكر الثاني",
          "مارك زوكربيرغ",
          "ستيفن هوكينج",
          "نيكولا تيسلا"
        ]
      }            
    ]
  }  