{
    "personalities": [
      {
        "id": 2,
        "language_code": "en",
        "type": "ENTJ",
        "name": "The Commander",
        "Description": "Commanders are natural-born leaders with a strong drive to achieve their goals. Known for their strategic thinking, charisma, and confidence, they excel at organizing and motivating others. They are forward-thinkers who thrive in competitive environments, often setting high standards for both themselves and those around them. Commanders value efficiency and take decisive actions to turn their visions into reality. In relationships, they appreciate partners who challenge them intellectually and share their ambitions, building long-term connections based on mutual respect and growth.",
        "Strengths": [
          "Ambitious",
          "Energetic",
          "Confident",
          "Strategic",
          "Inspiring",
          "Decisive",
          "Charismatic",
          "Innovative",
          "Self-assured",
          "Efficient",
          "Bold",
          "Knowledgeable",
          "Strong-willed"
        ],
        "Weaknesses": [
          "Stubborn",
          "Domineering",
          "Blunt",
          "Impatient",
          "Arrogant",
          "Intolerant",
          "Emotionally distant",
          "Insensitive",
          "Cold",
          "Ruthless"
        ],
        "DosInRelationship": [
          "Let them lead; they thrive on taking charge.",
          "Be gentle and supportive to complement their strong personality.",
          "Stay authentic—Commanders appreciate realness and depth.",
          "Acknowledge their skills and creativity to make them feel valued."
        ],
        "DontsInRelationship": [
          "Don’t play manipulative games—Commanders despise them.",
          "Avoid jealousy or trying to make them insecure; they'll move on quickly.",
          "Don’t engage in small talk or gossip—they’ll find it uninteresting.",
          "Don’t pressure them to open up emotionally too soon."
        ],
        "Friendships": "Commanders seek friendships with those who value growth and personal development. They thrive around friends who are goal-driven and ambitious. For Commanders, friendship means inspiring one another to push further. They enjoy intellectual discussions, but also value loyalty and trust in their closest friends. Commanders are invigorated by friends who share their level of energy and passion for meaningful pursuits.",
        "CareerPath": [
          "Aerospace Engineer",
          "Architect",
          "Architectural & Engineering Manager",
          "Chef",
          "Computer & IT Manager",
          "Electrical Engineer",
          "Emergency Management Director",
          "Epidemiologist",
          "Market Research Analyst",
          "Pharmacist"
        ],
        "LifeValue": [
          "Home/Family",
          "Health",
          "Financial Security",
          "Friendships",
          "Achievement"
        ],
        "CompatibleConnections": [
          "The Architect (INTJ)",
          "The Thinker (INTP)",
          "The Mediator (INFP)"
        ],
        "HasPotentialConnections": [
          "The Debater (ENTP)",
          "The Protagonist (ENFJ)",
          "The Campaigner (ENFP)",
          "The Advocate (INFJ)",
          "The Defender (ISFJ)",
          "The Virtuoso (ISTP)"
        ],
        "ChallengingConnections": [
          "The Adventurer (ISFP)",
          "The Consul (ESFJ)",
          "The Commander (ENTJ)",
          "The Executive (ESTJ)",
          "The Logistician (ISTJ)",
          "The Performer (ESFP)",
          "The Dynamo (ESTP)"
        ],
        "AttractedBy": [
          "Competent",
          "Rational",
          "Supportive",
          "Thoughtful",
          "Dependable",
          "Authentic",
          "Soft and gentle",
          "Loyal",
          "Caring",
          "Sincere",
          "Having depth",
          "Timely"
        ],
        "HowToBeCompanion": [
          "Challenge them intellectually—they enjoy meaningful debates.",
          "Support their long-term vision and goals; they need a partner who believes in their aspirations.",
          "Be direct and assertive in communication; they respect confidence.",
          "Encourage their leadership but also show your own initiative.",
          "Give them space to focus on their work and personal projects.",
          "Stay passionate and driven; they admire ambition and strength in a partner."
        ],
        "PetPeeves": [
          "Controlling",
          "Overemotional",
          "Manipulative",
          "Lazy",
          "Disorganized",
          "Tardy",
          "Passive-aggressive",
          "Superficial",
          "Incompetent",
          "Insincere",
          "Overformal",
          "Irrational"
        ],
        "SecretDesire": "Though they often appear as rational and decisive, Commanders secretly long for deeper meaning and fulfillment in their lives. Beyond material success, they seek relationships built on emotional depth and openness. Their true desire is to create something lasting—impacting the world in ways that go beyond the professional realm.",
        "Stereotypes": "Commanders are often seen as workaholics, overly focused on their goals and indifferent to social matters. However, in reality, they care deeply about inspiring others and helping them reach their full potential. Despite the tough exterior, they remain passionate about personal connections and creating meaningful change.",
        "Celebrities": [
          "Marcus Garvey",
          "Malcolm X",
          "LeBron James",
          "Napoleon Bonaparte",
          "Bill Gates",
          "Steve Jobs",
          "Arnold Schwarzenegger",
          "Adele",
          "George Clooney",
          "Joseph Stalin",
          "Dr. Dre"
        ]
      },
      {
        "id": 2,
        "language_code": "fr",
        "type": "ENTJ",
        "name": "Le Commandant",
        "Description": "Les Commandants sont des leaders nés avec une forte volonté d'atteindre leurs objectifs. Connus pour leur pensée stratégique, leur charisme et leur confiance, ils excellent dans l'organisation et la motivation des autres. Ils sont des visionnaires qui prospèrent dans des environnements compétitifs, fixant souvent des normes élevées pour eux-mêmes et pour ceux qui les entourent. Les Commandants valorisent l'efficacité et prennent des décisions fermes pour concrétiser leurs visions. En relations, ils apprécient les partenaires qui les défient intellectuellement et partagent leurs ambitions, construisant des connexions à long terme basées sur le respect mutuel et la croissance.",
        "Strengths": [
          "Ambitieux",
          "Énergique",
          "Confiant",
          "Stratégique",
          "Inspirant",
          "Décisif",
          "Charismatique",
          "Innovant",
          "Sûr de soi",
          "Efficace",
          "Audacieux",
          "Connaisseur",
          "Volontaire"
        ],
        "Weaknesses": [
          "Têtu",
          "Autoritaire",
          "Direct",
          "Impatient",
          "Arrogant",
          "Intolérant",
          "Distant émotionnellement",
          "Insensible",
          "Froid",
          "Impitoyable"
        ],
        "DosInRelationship": [
          "Laissez-les diriger; ils prospèrent lorsqu'ils prennent les rênes.",
          "Soyez doux et soutenez leur personnalité forte.",
          "Restez authentique—les Commandants apprécient la sincérité et la profondeur.",
          "Reconnaissez leurs compétences et leur créativité pour les faire se sentir valorisés."
        ],
        "DontsInRelationship": [
          "Ne jouez pas à des jeux manipulateurs—les Commandants les détestent.",
          "Évitez la jalousie ou les tentatives de les rendre insécures; ils passeront rapidement à autre chose.",
          "Ne vous engagez pas dans des commérages ou des discussions futiles—ils les trouveront inintéressants.",
          "Ne les forcez pas à s'ouvrir émotionnellement trop tôt."
        ],
        "Friendships": "Les Commandants recherchent des amitiés avec ceux qui valorisent la croissance et le développement personnel. Ils prospèrent entourés d'amis ambitieux et orientés vers des objectifs. Pour les Commandants, l'amitié signifie s'inspirer mutuellement pour aller plus loin. Ils apprécient les discussions intellectuelles, mais accordent également une grande valeur à la loyauté et à la confiance dans leurs amitiés les plus proches. Les Commandants sont stimulés par des amis qui partagent leur énergie et leur passion pour les entreprises significatives.",
        "CareerPath": [
          "Ingénieur aérospatial",
          "Architecte",
          "Directeur d'architecture et d'ingénierie",
          "Chef cuisinier",
          "Directeur informatique",
          "Ingénieur électricien",
          "Directeur de gestion des urgences",
          "Épidémiologiste",
          "Analyste de marché",
          "Pharmacien"
        ],
        "LifeValue": [
          "Maison/Famille",
          "Santé",
          "Sécurité financière",
          "Amitiés",
          "Réussite"
        ],
        "CompatibleConnections": [
          "L'Architecte (INTJ)",
          "Le Penseur (INTP)",
          "Le Médiateur (INFP)"
        ],
        "HasPotentialConnections": [
          "Le Débatteur (ENTP)",
          "Le Protagoniste (ENFJ)",
          "Le Campagneur (ENFP)",
          "L'Avocat (INFJ)",
          "Le Défenseur (ISFJ)",
          "Le Virtuose (ISTP)"
        ],
        "ChallengingConnections": [
          "L'Aventurier (ISFP)",
          "Le Consul (ESFJ)",
          "Le Commandant (ENTJ)",
          "L'Exécutif (ESTJ)",
          "Le Logicien (ISTJ)",
          "Le Performeur (ESFP)",
          "Le Dynamique (ESTP)"
        ],
        "AttractedBy": [
          "Compétent",
          "Rationnel",
          "Soutenant",
          "Réfléchi",
          "Fiable",
          "Authentique",
          "Doux et tendre",
          "Loyal",
          "Attentionné",
          "Sincère",
          "Ayant de la profondeur",
          "Ponctuel"
        ],
        "HowToBeCompanion": [
          "Défiez-les intellectuellement—ils aiment les débats significatifs.",
          "Soutenez leur vision à long terme et leurs objectifs; ils ont besoin d'un partenaire qui croit en leurs aspirations.",
          "Soyez direct et assertif dans la communication; ils respectent la confiance en soi.",
          "Encouragez leur leadership tout en montrant également votre propre initiative.",
          "Donnez-leur de l'espace pour se concentrer sur leur travail et leurs projets personnels.",
          "Restez passionné et motivé; ils admirent l'ambition et la force chez un partenaire."
        ],
        "PetPeeves": [
          "Contrôlant",
          "Trop émotif",
          "Manipulateur",
          "Paresseux",
          "Désorganisé",
          "En retard",
          "Passif-agressif",
          "Superficiel",
          "Incompétent",
          "Insincère",
          "Trop formel",
          "Irrationnel"
        ],
        "SecretDesire": "Bien qu'ils apparaissent souvent comme rationnels et décisifs, les Commandants aspirent secrètement à un sens plus profond et à l'épanouissement dans leur vie. Au-delà du succès matériel, ils cherchent des relations construites sur la profondeur émotionnelle et l'ouverture. Leur véritable désir est de créer quelque chose de durable—avoir un impact sur le monde au-delà du domaine professionnel.",
        "Stereotypes": "Les Commandants sont souvent perçus comme des bourreaux de travail, trop concentrés sur leurs objectifs et indifférents aux questions sociales. Cependant, en réalité, ils se soucient profondément d'inspirer les autres et de les aider à atteindre leur plein potentiel. Malgré leur apparence dure, ils restent passionnés par les relations personnelles et la création de changements significatifs.",
        "Celebrities": [
          "Marcus Garvey",
          "Malcolm X",
          "LeBron James",
          "Napoléon Bonaparte",
          "Bill Gates",
          "Steve Jobs",
          "Arnold Schwarzenegger",
          "Adele",
          "George Clooney",
          "Joseph Staline",
          "Dr. Dre"
        ]
      },
      {
        "id": 2,
        "language_code": "es",
        "type": "ENTJ",
        "name": "El Comandante",
        "Description": "Los Comandantes son líderes natos con una fuerte determinación para alcanzar sus metas. Conocidos por su pensamiento estratégico, carisma y confianza, sobresalen en organizar y motivar a los demás. Son visionarios que prosperan en entornos competitivos, estableciendo estándares altos tanto para ellos mismos como para quienes los rodean. Los Comandantes valoran la eficiencia y toman decisiones decisivas para convertir sus visiones en realidad. En las relaciones, aprecian a las parejas que los desafían intelectualmente y comparten sus ambiciones, construyendo conexiones a largo plazo basadas en el respeto mutuo y el crecimiento.",
        "Strengths": [
          "Ambicioso",
          "Energético",
          "Confiado",
          "Estratégico",
          "Inspirador",
          "Decisivo",
          "Carismático",
          "Innovador",
          "Seguro de sí mismo",
          "Eficiente",
          "Audaz",
          "Conocedor",
          "De voluntad fuerte"
        ],
        "Weaknesses": [
          "Testarudo",
          "Autoritario",
          "Directo",
          "Impaciente",
          "Arrogante",
          "Intolerante",
          "Distante emocionalmente",
          "Insensible",
          "Frío",
          "Despiadado"
        ],
        "DosInRelationship": [
          "Déjalos liderar; prosperan cuando están a cargo.",
          "Sé amable y comprensivo para complementar su fuerte personalidad.",
          "Mantente auténtico—los Comandantes aprecian la sinceridad y la profundidad.",
          "Reconoce sus habilidades y creatividad para que se sientan valorados."
        ],
        "DontsInRelationship": [
          "No juegues juegos manipuladores—los Comandantes los detestan.",
          "Evita la celosía o intentar hacerlos sentir inseguros; pasarán rápidamente a otra cosa.",
          "No te involucres en conversaciones triviales o chismes—lo encontrarán poco interesante.",
          "No los presiones para que se abran emocionalmente demasiado pronto."
        ],
        "Friendships": "Los Comandantes buscan amistades con aquellos que valoran el crecimiento y el desarrollo personal. Prosperan con amigos que son ambiciosos y orientados a metas. Para los Comandantes, la amistad significa inspirarse mutuamente a llegar más lejos. Disfrutan de las discusiones intelectuales, pero también valoran la lealtad y la confianza en sus amigos más cercanos. Los Comandantes se sienten energizados por amigos que comparten su nivel de energía y pasión por las actividades significativas.",
        "CareerPath": [
          "Ingeniero aeroespacial",
          "Arquitecto",
          "Director de Arquitectura e Ingeniería",
          "Chef",
          "Gerente de TI",
          "Ingeniero eléctrico",
          "Director de Gestión de Emergencias",
          "Epidemiólogo",
          "Analista de mercado",
          "Farmacéutico"
        ],
        "LifeValue": [
          "Hogar/Familia",
          "Salud",
          "Seguridad financiera",
          "Amistades",
          "Logros"
        ],
        "CompatibleConnections": [
          "El Arquitecto (INTJ)",
          "El Pensador (INTP)",
          "El Mediador (INFP)"
        ],
        "HasPotentialConnections": [
          "El Debatidor (ENTP)",
          "El Protagonista (ENFJ)",
          "El Campañero (ENFP)",
          "El Abogado (INFJ)",
          "El Defensor (ISFJ)",
          "El Virtuoso (ISTP)"
        ],
        "ChallengingConnections": [
          "El Aventurero (ISFP)",
          "El Cónsul (ESFJ)",
          "El Comandante (ENTJ)",
          "El Ejecutivo (ESTJ)",
          "El Lógico (ISTJ)",
          "El Intérprete (ESFP)",
          "El Dinámico (ESTP)"
        ],
        "AttractedBy": [
          "Competente",
          "Racional",
          "Apoyo",
          "Reflexivo",
          "Fiable",
          "Auténtico",
          "Dulce y suave",
          "Leal",
          "Cariñoso",
          "Sincero",
          "Profundo",
          "Puntual"
        ],
        "HowToBeCompanion": [
          "Desafíalos intelectualmente—disfrutan de debates significativos.",
          "Apoya su visión y objetivos a largo plazo; necesitan un compañero que crea en sus aspiraciones.",
          "Sé directo y asertivo en la comunicación; respetan la confianza.",
          "Fomenta su liderazgo, pero también muestra tu propia iniciativa.",
          "Dales espacio para concentrarse en su trabajo y proyectos personales.",
          "Mantente apasionado y motivado; admiran la ambición y la fuerza en una pareja."
        ],
        "PetPeeves": [
          "Controlador",
          "Demasiado emocional",
          "Manipulador",
          "Perezoso",
          "Desorganizado",
          "Impuntual",
          "Pasivo-agresivo",
          "Superficial",
          "Incompetente",
          "Insincero",
          "Demasiado formal",
          "Irracional"
        ],
        "SecretDesire": "Aunque a menudo parecen racionales y decisivos, los Comandantes anhelan en secreto un significado más profundo y realización en sus vidas. Más allá del éxito material, buscan relaciones basadas en la profundidad emocional y la apertura. Su verdadero deseo es crear algo duradero—impactar el mundo de formas que trasciendan lo profesional.",
        "Stereotypes": "Los Comandantes a menudo son vistos como adictos al trabajo, demasiado enfocados en sus metas e indiferentes a los asuntos sociales. Sin embargo, en realidad, se preocupan profundamente por inspirar a los demás y ayudarlos a alcanzar su máximo potencial. A pesar de su exterior duro, siguen siendo apasionados por las conexiones personales y la creación de cambios significativos.",
        "Celebrities": [
          "Marcus Garvey",
          "Malcolm X",
          "LeBron James",
          "Napoleón Bonaparte",
          "Bill Gates",
          "Steve Jobs",
          "Arnold Schwarzenegger",
          "Adele",
          "George Clooney",
          "Joseph Stalin",
          "Dr. Dre"
        ]
      },
      {
        "id": 2,
        "language_code": "pt",
        "type": "ENTJ",
        "name": "O Comandante",
        "Description": "Os Comandantes são líderes natos com uma forte motivação para alcançar seus objetivos. Conhecidos por seu pensamento estratégico, carisma e confiança, eles se destacam em organizar e motivar os outros. Eles são visionários que prosperam em ambientes competitivos, muitas vezes estabelecendo altos padrões para si mesmos e para aqueles ao seu redor. Os Comandantes valorizam a eficiência e tomam decisões firmes para transformar suas visões em realidade. Em relacionamentos, eles apreciam parceiros que os desafiam intelectualmente e compartilham suas ambições, construindo conexões duradouras baseadas no respeito mútuo e no crescimento.",
        "Strengths": [
          "Ambicioso",
          "Energético",
          "Confiante",
          "Estratégico",
          "Inspirador",
          "Decisivo",
          "Carismático",
          "Inovador",
          "Seguro de si",
          "Eficiente",
          "Audaz",
          "Conhecedor",
          "Determinado"
        ],
        "Weaknesses": [
          "Teimoso",
          "Dominador",
          "Franco",
          "Impaciente",
          "Arrogante",
          "Intolerante",
          "Distante emocionalmente",
          "Insensível",
          "Frio",
          "Implacável"
        ],
        "DosInRelationship": [
          "Deixe-os liderar; eles prosperam quando estão no controle.",
          "Seja gentil e solidário para complementar sua forte personalidade.",
          "Seja autêntico—os Comandantes valorizam a sinceridade e a profundidade.",
          "Reconheça suas habilidades e criatividade para fazê-los sentir-se valorizados."
        ],
        "DontsInRelationship": [
          "Não jogue jogos manipulativos—os Comandantes os desprezam.",
          "Evite ciúmes ou tentar fazê-los sentir-se inseguros; eles seguirão em frente rapidamente.",
          "Não envolva fofocas ou conversa fiada—eles acharão isso desinteressante.",
          "Não os pressione a se abrir emocionalmente muito cedo."
        ],
        "Friendships": "Os Comandantes procuram amizades com aqueles que valorizam o crescimento e o desenvolvimento pessoal. Eles prosperam ao redor de amigos que são orientados para objetivos e ambiciosos. Para os Comandantes, amizade significa inspirar uns aos outros a ir mais longe. Eles apreciam discussões intelectuais, mas também valorizam a lealdade e a confiança em seus amigos mais próximos. Os Comandantes são energizados por amigos que compartilham seu nível de energia e paixão por empreendimentos significativos.",
        "CareerPath": [
          "Engenheiro aeroespacial",
          "Arquiteto",
          "Gerente de Arquitetura e Engenharia",
          "Chef",
          "Gerente de TI",
          "Engenheiro elétrico",
          "Diretor de Gestão de Emergências",
          "Epidemiologista",
          "Analista de Mercado",
          "Farmacêutico"
        ],
        "LifeValue": [
          "Casa/Família",
          "Saúde",
          "Segurança financeira",
          "Amizades",
          "Realizações"
        ],
        "CompatibleConnections": [
          "O Arquiteto (INTJ)",
          "O Pensador (INTP)",
          "O Mediador (INFP)"
        ],
        "HasPotentialConnections": [
          "O Debatedor (ENTP)",
          "O Protagonista (ENFJ)",
          "O Campanha (ENFP)",
          "O Advogado (INFJ)",
          "O Defensor (ISFJ)",
          "O Virtuoso (ISTP)"
        ],
        "ChallengingConnections": [
          "O Aventureiro (ISFP)",
          "O Cônsul (ESFJ)",
          "O Comandante (ENTJ)",
          "O Executivo (ESTJ)",
          "O Lógico (ISTJ)",
          "O Performador (ESFP)",
          "O Dinâmico (ESTP)"
        ],
        "AttractedBy": [
          "Competente",
          "Racional",
          "Solidário",
          "Atencioso",
          "Confiável",
          "Autêntico",
          "Suave e gentil",
          "Leal",
          "Carinhoso",
          "Sincero",
          "Profundo",
          "Pontual"
        ],
        "HowToBeCompanion": [
          "Desafie-os intelectualmente—eles gostam de debates significativos.",
          "Apoie sua visão de longo prazo e seus objetivos; eles precisam de um parceiro que acredite em suas aspirações.",
          "Seja direto e assertivo na comunicação; eles respeitam a confiança.",
          "Incentive sua liderança, mas também mostre sua própria iniciativa.",
          "Dê-lhes espaço para se concentrar em seu trabalho e projetos pessoais.",
          "Mantenha-se apaixonado e motivado; eles admiram ambição e força em um parceiro."
        ],
        "PetPeeves": [
          "Controlador",
          "Excessivamente emocional",
          "Manipulador",
          "Preguiçoso",
          "Desorganizado",
          "Atrasado",
          "Passivo-agressivo",
          "Superficial",
          "Incompetente",
          "Insincero",
          "Excessivamente formal",
          "Irracional"
        ],
        "SecretDesire": "Embora muitas vezes pareçam racionais e decisivos, os Comandantes secretamente anseiam por um significado mais profundo e realização em suas vidas. Além do sucesso material, eles procuram relacionamentos construídos com base na profundidade emocional e na abertura. Seu verdadeiro desejo é criar algo duradouro—impactar o mundo de maneiras que vão além do campo profissional.",
        "Stereotypes": "Os Comandantes são frequentemente vistos como viciados em trabalho, excessivamente focados em seus objetivos e indiferentes a questões sociais. No entanto, na realidade, eles se preocupam profundamente em inspirar os outros e ajudá-los a atingir seu pleno potencial. Apesar de sua aparência dura, eles continuam sendo apaixonados por conexões pessoais e por criar mudanças significativas.",
        "Celebrities": [
          "Marcus Garvey",
          "Malcolm X",
          "LeBron James",
          "Napoleão Bonaparte",
          "Bill Gates",
          "Steve Jobs",
          "Arnold Schwarzenegger",
          "Adele",
          "George Clooney",
          "Joseph Stalin",
          "Dr. Dre"
        ]
      },
      {
        "id": 2,
        "language_code": "ar",
        "type": "ENTJ",
        "name": "القائد",
        "Description": "القادة هم قادة بالفطرة يتمتعون بدافع قوي لتحقيق أهدافهم. معروفون بتفكيرهم الاستراتيجي وكاريزميتهم وثقتهم، يتفوقون في تنظيم الآخرين وتحفيزهم. إنهم مفكرون متقدمون يزدهرون في البيئات التنافسية، وغالبًا ما يضعون معايير عالية لأنفسهم ولمن حولهم. يقدر القادة الكفاءة ويتخذون إجراءات حاسمة لتحويل رؤاهم إلى واقع. في العلاقات، يقدرون الشركاء الذين يتحدونهم فكريًا ويشاركونهم طموحاتهم، ويبنوا علاقات طويلة الأمد قائمة على الاحترام المتبادل والنمو.",
        "Strengths": [
          "طموح",
          "نشيط",
          "واثق",
          "استراتيجي",
          "ملهم",
          "حاسم",
          "كاريزمي",
          "مبتكر",
          "واثق من نفسه",
          "فعال",
          "جريء",
          "واسع المعرفة",
          "صاحب إرادة قوية"
        ],
        "Weaknesses": [
          "عنيد",
          "مستبد",
          "مباشر للغاية",
          "غير صبور",
          "متعجرف",
          "غير متسامح",
          "بعيد عاطفيًا",
          "غير حساس",
          "بارد",
          "قاسي"
        ],
        "DosInRelationship": [
          "دعهم يقودون؛ إنهم يزدهرون عندما يتولون المسؤولية.",
          "كن لطيفًا وداعمًا لتكمل شخصيتهم القوية.",
          "ابقَ حقيقيًا - القادة يقدرون الصدق والعمق.",
          "اعترف بمهاراتهم وإبداعهم لجعلهم يشعرون بالتقدير."
        ],
        "DontsInRelationship": [
          "لا تلعب ألعابًا تلاعبية - القادة يكرهونها.",
          "تجنب الغيرة أو محاولة جعلهم غير واثقين؛ سوف يمضون بسرعة.",
          "لا تشارك في الأحاديث الصغيرة أو النميمة - سيجدونها غير مثيرة للاهتمام.",
          "لا تضغط عليهم لفتح مشاعرهم بسرعة."
        ],
        "Friendships": "يبحث القادة عن صداقات مع أولئك الذين يقدرون النمو والتطوير الشخصي. إنهم يزدهرون حول أصدقاء لديهم أهداف وطموحات. بالنسبة للقادة، تعني الصداقة إلهام بعضهم البعض لتحقيق المزيد. إنهم يستمتعون بالمناقشات الفكرية، لكنهم أيضًا يقدرون الولاء والثقة في أصدقائهم المقربين. يتم تنشيط القادة من خلال أصدقاء يشاركونهم مستوى طاقتهم وشغفهم بالأنشطة المهمة.",
        "CareerPath": [
          "مهندس طيران",
          "مهندس معماري",
          "مدير العمارة والهندسة",
          "طاهٍ",
          "مدير تقنية المعلومات",
          "مهندس كهربائي",
          "مدير إدارة الطوارئ",
          "أخصائي علم الأوبئة",
          "محلل أبحاث السوق",
          "صيدلاني"
        ],
        "LifeValue": [
          "المنزل/العائلة",
          "الصحة",
          "الأمان المالي",
          "الصداقات",
          "الإنجاز"
        ],
        "CompatibleConnections": [
          "المهندس المعماري (INTJ)",
          "المفكر (INTP)",
          "الوسيط (INFP)"
        ],
        "HasPotentialConnections": [
          "المناظر (ENTP)",
          "البطل (ENFJ)",
          "المروج (ENFP)",
          "المحامي (INFJ)",
          "المدافع (ISFJ)",
          "المبدع (ISTP)"
        ],
        "ChallengingConnections": [
          "المغامر (ISFP)",
          "القنصل (ESFJ)",
          "القائد (ENTJ)",
          "المدير التنفيذي (ESTJ)",
          "المنطقي (ISTJ)",
          "المؤدي (ESFP)",
          "الدينامو (ESTP)"
        ],
        "AttractedBy": [
          "كفء",
          "عقلاني",
          "داعم",
          "مدروس",
          "يعتمد عليه",
          "صادق",
          "لطيف وحنون",
          "وفي",
          "مُهتم",
          "صريح",
          "عميق",
          "ملتزم بالمواعيد"
        ],
        "HowToBeCompanion": [
          "تحداهم فكريًا - يستمتعون بالنقاشات الهادفة.",
          "ادعم رؤيتهم طويلة الأجل وأهدافهم؛ إنهم بحاجة إلى شريك يؤمن بطموحاتهم.",
          "كن مباشرًا وحازمًا في التواصل؛ يحترمون الثقة.",
          "شجع قيادتهم ولكن أظهر أيضًا مبادرتك الخاصة.",
          "امنحهم مساحة للتركيز على عملهم ومشاريعهم الشخصية.",
          "ابقَ شغوفًا ودافعًا؛ يعجبون بالطموح والقوة في شريكهم."
        ],
        "PetPeeves": [
          "متحكم",
          "مفرط في العاطفة",
          "متلاعب",
          "كسول",
          "غير منظم",
          "متأخر",
          "سلبي عدواني",
          "سطحي",
          "غير كفء",
          "غير صادق",
          "رسمي جدًا",
          "غير منطقي"
        ],
        "SecretDesire": "على الرغم من أنهم يظهرون غالبًا كعقلانيين وحاسمين، إلا أن القادة يتوقون سرًا إلى معنى أعمق وإشباع في حياتهم. إلى جانب النجاح المادي، يسعون إلى علاقات مبنية على العمق العاطفي والانفتاح. رغبتهم الحقيقية هي إنشاء شيء دائم - التأثير في العالم بطرق تتجاوز المجال المهني.",
        "Stereotypes": "غالبًا ما يُنظر إلى القادة على أنهم مدمنو عمل، مهووسون بأهدافهم وغير مهتمين بالقضايا الاجتماعية. ومع ذلك، في الواقع، يهتمون بعمق بإلهام الآخرين ومساعدتهم على تحقيق إمكاناتهم الكاملة. على الرغم من مظهرهم القاسي، إلا أنهم يظلون شغوفين بالاتصالات الشخصية وخلق تغيير ذو مغزى.",
        "Celebrities": [
          "ماركوس غارفي",
          "مالكوم إكس",
          "ليبرون جيمس",
          "نابليون بونابرت",
          "بيل غيتس",
          "ستيف جوبز",
          "أرنولد شوارزنيجر",
          "أديل",
          "جورج كلوني",
          "جوزيف ستالين",
          "د. دري"
        ]
      }      
    ]
  }  