{
    "personalities": [
      {
        "id": 7,
        "language_code": "en",
        "type": "ESTJ",
        "name": "The Executive",
        "Description": "Executives are natural organizers, known for their strong leadership and sense of duty. They value order, discipline, and efficiency, always striving to create stability in their environments. While sometimes seen as rigid, their dedication to doing what’s right makes them reliable and trustworthy. They seek practical solutions and have a strong sense of responsibility, which leads them to take charge in almost any situation.",
        "Strengths": [
          "Dedicated",
          "Strong-willed",
          "Direct and honest",
          "Loyal",
          "Patient",
          "Reliable",
          "Enjoy creating order",
          "Excellent organizers"
        ],
        "Weaknesses": [
          "Inflexible and stubborn",
          "Uncomfortable with unconventional situations",
          "Judgmental",
          "Too focused on social status",
          "Difficult to relax",
          "Difficulty expressing emotion"
        ],
        "DosInRelationship": [
          "Be gentle and kind—they appreciate softness balancing their strength.",
          "Let them take charge; they enjoy being the leader.",
          "Show you're reliable by keeping promises—they'll respect that.",
          "Be honest and clear in communication; avoid emotional drama.",
          "Help with practical tasks—they value tangible gestures.",
          "Respect their space and time with family and friends."
        ],
        "DontsInRelationship": [
          "Avoid manipulative games and inauthentic behavior; it’s a major turn-off.",
          "Don’t be overly sexual too soon; they value self-control.",
          "Don’t act lazy or disorganized.",
          "Avoid pushing them to open up emotionally before they’re ready.",
          "Don’t ignore social rules or show up late; this frustrates them."
        ],
        "Friendships": "Executives value friendships based on shared values and work ethics. While they may have strong principles, they form bonds through common interests, hobbies, and routines. They prioritize loyalty and love organizing events for group activities, ensuring everyone enjoys time together.",
        "CareerPath": [
          "Auditor",
          "Commercial Pilot",
          "Computer Repairer",
          "Construction Manager",
          "Correction Officer",
          "Criminal Investigator",
          "Home Health Aides",
          "Personal Financial Advisor",
          "Police, Fire & Ambulance Dispatcher",
          "Sheriff & Deputy Sheriff"
        ],
        "LifeValue": [
          "Home/Family",
          "Health",
          "Financial Security",
          "Achievement",
          "Friendships"
        ],
        "CompatibleConnections": [
          "The Logistician (ISTJ)",
          "The Virtuoso (ISTP)",
          "The Adventurer (ISFP)"
        ],
        "HasPotentialConnections": [
          "The Thinker (INTP)",
          "The Advocate (INFJ)",
          "The Mediator (INFP)",
          "The Consul (ESFJ)",
          "The Performer (ESFP)",
          "The Defender (ISFJ)",
          "The Dynamo (ESTP)"
        ],
        "ChallengingConnections": [
          "The Architect (INTJ)",
          "The Campaigner (ENFP)",
          "The Debater (ENTP)",
          "The Protagonist (ENFJ)",
          "The Commander (ENTJ)",
          "The Executive (ESTJ)"
        ],
        "AttractedBy": [
          "Soft and gentle",
          "Warm",
          "Caring",
          "Reliable",
          "Responsible",
          "Detailed",
          "Honest",
          "Dutiful",
          "Logical",
          "Easygoing"
        ],
        "PetPeeves": [
          "Tardy",
          "Incompetent",
          "Undetailed",
          "Overemotional",
          "Illogical",
          "Irresponsible",
          "Lazy",
          "Disorganized",
          "Whiny",
          "Complaining",
          "Disrespectful",
          "Flaky",
          "Procrastinating"
        ],
        "HowToBeCompanion": [
          "Be organized and take initiative in your shared responsibilities.",
          "Show respect for their leadership qualities, but don’t be afraid to offer input.",
          "Provide practical solutions rather than emotional responses to problems.",
          "Be direct and honest in communication—they appreciate clarity.",
          "Respect their need for structure and stability in life.",
          "Support their ambitions and demonstrate your own drive and commitment."
        ],
        "SecretDesire": "Executives appear logical and straightforward, but deep down they crave personal fulfillment through meaningful contributions. They often desire to make a positive impact beyond professional success, yearning for connection through charitable or social causes that bring purpose to their lives.",
        "Stereotypes": "Many mistake Executives for being controlling or overly concerned with rules. In reality, they care deeply about helping others and are willing to go above and beyond for those they love. These personalities balance their structured approach to life with a genuine desire to improve the world around them.",
        "Celebrities": [
          "Mansa Musa",
          "Mobutu Sese Seko",
          "Serena Williams",
          "Michelle Obama",
          "Dr. Phil McGraw",
          "Hillary Clinton",
          "Saddam Hussein",
          "Emma Watson",
          "Rose Kennedy",
          "Ivanka Trump",
          "Nancy Grace"
        ]
      },
      {
        "id": 7,
        "language_code": "fr",
        "type": "ESTJ",
        "name": "L'Exécutif",
        "Description": "Les Exécutifs sont des organisateurs naturels, connus pour leur fort leadership et leur sens du devoir. Ils apprécient l'ordre, la discipline et l'efficacité, cherchant toujours à créer de la stabilité dans leur environnement. Bien qu'ils puissent parfois être perçus comme rigides, leur dévouement à faire ce qui est juste les rend fiables et dignes de confiance. Ils recherchent des solutions pratiques et ont un fort sens des responsabilités, ce qui les pousse à prendre les choses en main dans presque toutes les situations.",
        "Strengths": [
          "Dévoué",
          "Volontaire",
          "Direct et honnête",
          "Loyal",
          "Patient",
          "Fiable",
          "Aime créer de l'ordre",
          "Excellents organisateurs"
        ],
        "Weaknesses": [
          "Rigide et têtu",
          "Mal à l'aise dans les situations non conventionnelles",
          "Juge rapidement",
          "Trop axé sur le statut social",
          "Difficile de se détendre",
          "Difficulté à exprimer ses émotions"
        ],
        "DosInRelationship": [
          "Soyez doux et aimable – ils apprécient la douceur qui équilibre leur force.",
          "Laissez-les prendre les commandes; ils aiment être les leaders.",
          "Montrez que vous êtes fiable en tenant vos promesses – ils respecteront cela.",
          "Soyez honnête et clair dans la communication; évitez le drame émotionnel.",
          "Aidez avec les tâches pratiques – ils apprécient les gestes concrets.",
          "Respectez leur espace et leur temps avec la famille et les amis."
        ],
        "DontsInRelationship": [
          "Évitez les jeux manipulateurs et les comportements inauthentiques; cela les rebute.",
          "Ne soyez pas trop sexuel trop tôt; ils valorisent le contrôle de soi.",
          "Ne soyez pas paresseux ou désorganisé.",
          "Évitez de les pousser à s'ouvrir émotionnellement avant qu'ils ne soient prêts.",
          "Ne négligez pas les règles sociales ou n'arrivez pas en retard; cela les frustre."
        ],
        "Friendships": "Les Exécutifs apprécient les amitiés fondées sur des valeurs partagées et une éthique de travail. Bien qu'ils aient des principes forts, ils créent des liens à travers des intérêts communs, des passe-temps et des routines. Ils privilégient la loyauté et adorent organiser des événements pour des activités de groupe, s'assurant que tout le monde passe un bon moment ensemble.",
        "CareerPath": [
          "Auditeur",
          "Pilote commercial",
          "Réparateur d'ordinateurs",
          "Directeur de chantier",
          "Agent pénitentiaire",
          "Enquêteur criminel",
          "Aide à domicile",
          "Conseiller financier personnel",
          "Répartiteur de la police, des pompiers et des ambulances",
          "Shérif et adjoint au shérif"
        ],
        "LifeValue": [
          "Maison/Famille",
          "Santé",
          "Sécurité financière",
          "Réussite",
          "Amitiés"
        ],
        "CompatibleConnections": [
          "Le Logisticien (ISTJ)",
          "Le Virtuose (ISTP)",
          "L'Aventurier (ISFP)"
        ],
        "HasPotentialConnections": [
          "Le Penseur (INTP)",
          "L'Avocat (INFJ)",
          "Le Médiateur (INFP)",
          "Le Consul (ESFJ)",
          "Le Performeur (ESFP)",
          "Le Défenseur (ISFJ)",
          "Le Dynamique (ESTP)"
        ],
        "ChallengingConnections": [
          "L'Architecte (INTJ)",
          "Le Campagneur (ENFP)",
          "Le Débatteur (ENTP)",
          "Le Protagoniste (ENFJ)",
          "Le Commandant (ENTJ)",
          "L'Exécutif (ESTJ)"
        ],
        "AttractedBy": [
          "Doux et aimable",
          "Chaleureux",
          "Attentionné",
          "Fiable",
          "Responsable",
          "Détaillé",
          "Honnête",
          "Consciencieux",
          "Logique",
          "Décontracté"
        ],
        "PetPeeves": [
          "En retard",
          "Incompétent",
          "Peu détaillé",
          "Trop émotionnel",
          "Illogique",
          "Irresponsable",
          "Paresseux",
          "Désorganisé",
          "Pleurnicheur",
          "Plaignant",
          "Irrespectueux",
          "Indécis",
          "Procrastinateur"
        ],
        "HowToBeCompanion": [
          "Soyez organisé et prenez des initiatives dans vos responsabilités partagées.",
          "Montrez du respect pour leurs qualités de leadership, mais n'ayez pas peur de donner votre avis.",
          "Proposez des solutions pratiques plutôt que des réponses émotionnelles aux problèmes.",
          "Soyez direct et honnête dans la communication – ils apprécient la clarté.",
          "Respectez leur besoin de structure et de stabilité dans la vie.",
          "Soutenez leurs ambitions et démontrez votre propre dynamisme et engagement."
        ],
        "SecretDesire": "Les Exécutifs peuvent sembler logiques et directs, mais au fond, ils recherchent l'épanouissement personnel à travers des contributions significatives. Ils désirent souvent avoir un impact positif au-delà du succès professionnel, aspirant à se connecter par le biais de causes caritatives ou sociales qui donnent un sens à leur vie.",
        "Stereotypes": "Beaucoup considèrent à tort les Exécutifs comme contrôlants ou trop préoccupés par les règles. En réalité, ils tiennent profondément à aider les autres et sont prêts à se surpasser pour ceux qu'ils aiment. Ces personnalités équilibrent leur approche structurée de la vie avec un désir sincère d'améliorer le monde qui les entoure.",
        "Celebrities": [
          "Mansa Musa",
          "Mobutu Sese Seko",
          "Serena Williams",
          "Michelle Obama",
          "Dr. Phil McGraw",
          "Hillary Clinton",
          "Saddam Hussein",
          "Emma Watson",
          "Rose Kennedy",
          "Ivanka Trump",
          "Nancy Grace"
        ]
      },
      {
        "id": 7,
        "language_code": "es",
        "type": "ESTJ",
        "name": "El Ejecutivo",
        "Description": "Los Ejecutivos son organizadores naturales, conocidos por su fuerte liderazgo y sentido del deber. Valoran el orden, la disciplina y la eficiencia, siempre esforzándose por crear estabilidad en su entorno. Aunque a veces se les ve como rígidos, su dedicación a hacer lo correcto los hace confiables y dignos de confianza. Buscan soluciones prácticas y tienen un fuerte sentido de la responsabilidad, lo que los lleva a tomar el mando en casi cualquier situación.",
        "Strengths": [
          "Dedicado",
          "Tenaz",
          "Directo y honesto",
          "Leal",
          "Paciente",
          "Fiable",
          "Disfruta creando orden",
          "Excelentes organizadores"
        ],
        "Weaknesses": [
          "Inflexible y terco",
          "Incómodo en situaciones no convencionales",
          "Juzga rápidamente",
          "Demasiado enfocado en el estatus social",
          "Dificultad para relajarse",
          "Dificultad para expresar emociones"
        ],
        "DosInRelationship": [
          "Sé amable y gentil; aprecian la suavidad que equilibra su fortaleza.",
          "Déjalos tomar el mando; disfrutan ser los líderes.",
          "Muestra que eres confiable cumpliendo tus promesas; lo respetarán.",
          "Sé honesto y claro en la comunicación; evita el drama emocional.",
          "Ayuda con tareas prácticas; valoran los gestos tangibles.",
          "Respeta su espacio y su tiempo con la familia y amigos."
        ],
        "DontsInRelationship": [
          "Evita los juegos manipulativos y el comportamiento inauténtico; les resulta muy desagradable.",
          "No seas demasiado sexual demasiado pronto; valoran el autocontrol.",
          "No actúes de manera perezosa o desorganizada.",
          "Evita presionarlos para que se abran emocionalmente antes de que estén listos.",
          "No ignores las normas sociales ni llegues tarde; esto los frustra."
        ],
        "Friendships": "Los Ejecutivos valoran las amistades basadas en valores compartidos y ética de trabajo. Aunque pueden tener principios fuertes, forman lazos a través de intereses comunes, pasatiempos y rutinas. Priorizan la lealtad y disfrutan organizando eventos para actividades grupales, asegurándose de que todos pasen un buen rato juntos.",
        "CareerPath": [
          "Auditor",
          "Piloto comercial",
          "Reparador de computadoras",
          "Gerente de construcción",
          "Oficial de correcciones",
          "Investigador criminal",
          "Asistentes de salud a domicilio",
          "Asesor financiero personal",
          "Despachador de policía, bomberos y ambulancias",
          "Sheriff y ayudante del sheriff"
        ],
        "LifeValue": [
          "Hogar/Familia",
          "Salud",
          "Seguridad financiera",
          "Logro",
          "Amistades"
        ],
        "CompatibleConnections": [
          "El Logístico (ISTJ)",
          "El Virtuoso (ISTP)",
          "El Aventurero (ISFP)"
        ],
        "HasPotentialConnections": [
          "El Pensador (INTP)",
          "El Abogado (INFJ)",
          "El Mediador (INFP)",
          "El Cónsul (ESFJ)",
          "El Intérprete (ESFP)",
          "El Defensor (ISFJ)",
          "El Dinámico (ESTP)"
        ],
        "ChallengingConnections": [
          "El Arquitecto (INTJ)",
          "El Campañero (ENFP)",
          "El Debatidor (ENTP)",
          "El Protagonista (ENFJ)",
          "El Comandante (ENTJ)",
          "El Ejecutivo (ESTJ)"
        ],
        "AttractedBy": [
          "Suave y gentil",
          "Cálido",
          "Cariñoso",
          "Fiable",
          "Responsable",
          "Detallado",
          "Honesto",
          "Con sentido del deber",
          "Lógico",
          "Relajado"
        ],
        "PetPeeves": [
          "Tardío",
          "Incompetente",
          "Falta de detalles",
          "Demasiado emocional",
          "Ilógico",
          "Irresponsable",
          "Perezoso",
          "Desorganizado",
          "Quejumbroso",
          "Despectivo",
          "Irrespetuoso",
          "Inconstante",
          "Procrastinador"
        ],
        "HowToBeCompanion": [
          "Sé organizado y toma la iniciativa en las responsabilidades compartidas.",
          "Muestra respeto por sus cualidades de liderazgo, pero no temas ofrecer tu opinión.",
          "Proporciona soluciones prácticas en lugar de respuestas emocionales a los problemas.",
          "Sé directo y honesto en la comunicación; aprecian la claridad.",
          "Respeta su necesidad de estructura y estabilidad en la vida.",
          "Apoya sus ambiciones y demuestra tu propio impulso y compromiso."
        ],
        "SecretDesire": "Los Ejecutivos parecen lógicos y directos, pero en el fondo desean el cumplimiento personal a través de contribuciones significativas. A menudo anhelan tener un impacto positivo más allá del éxito profesional, deseando conectar con causas caritativas o sociales que den propósito a sus vidas.",
        "Stereotypes": "Muchos confunden a los Ejecutivos con ser controladores o demasiado preocupados por las reglas. En realidad, se preocupan profundamente por ayudar a los demás y están dispuestos a hacer todo lo posible por aquellos que aman. Estas personalidades equilibran su enfoque estructurado de la vida con un deseo genuino de mejorar el mundo que los rodea.",
        "Celebrities": [
          "Mansa Musa",
          "Mobutu Sese Seko",
          "Serena Williams",
          "Michelle Obama",
          "Dr. Phil McGraw",
          "Hillary Clinton",
          "Saddam Hussein",
          "Emma Watson",
          "Rose Kennedy",
          "Ivanka Trump",
          "Nancy Grace"
        ]
      },
      {
        "id": 7,
        "language_code": "pt",
        "type": "ESTJ",
        "name": "O Executivo",
        "Description": "Os Executivos são organizadores naturais, conhecidos por sua forte liderança e senso de dever. Valorizam a ordem, a disciplina e a eficiência, sempre se esforçando para criar estabilidade em seus ambientes. Embora às vezes sejam vistos como rígidos, sua dedicação a fazer o que é certo os torna confiáveis e dignos de confiança. Eles buscam soluções práticas e têm um forte senso de responsabilidade, o que os leva a assumir o controle em quase qualquer situação.",
        "Strengths": [
          "Dedicado",
          "Determinado",
          "Direto e honesto",
          "Leal",
          "Paciente",
          "Confiável",
          "Gosta de criar ordem",
          "Excelentes organizadores"
        ],
        "Weaknesses": [
          "Inflexível e teimoso",
          "Desconfortável em situações não convencionais",
          "Julgador",
          "Focado demais no status social",
          "Dificuldade em relaxar",
          "Dificuldade em expressar emoções"
        ],
        "DosInRelationship": [
          "Seja gentil e amável – eles apreciam a suavidade que equilibra sua força.",
          "Deixe-os assumir o controle; eles gostam de ser os líderes.",
          "Mostre que você é confiável cumprindo promessas – eles respeitarão isso.",
          "Seja honesto e claro na comunicação; evite dramas emocionais.",
          "Ajude com tarefas práticas – eles valorizam gestos concretos.",
          "Respeite seu espaço e tempo com a família e amigos."
        ],
        "DontsInRelationship": [
          "Evite jogos manipulativos e comportamentos inautênticos; isso os desagrada.",
          "Não seja muito sexual muito cedo; eles valorizam o autocontrole.",
          "Não aja de forma preguiçosa ou desorganizada.",
          "Evite pressioná-los para se abrir emocionalmente antes que estejam prontos.",
          "Não ignore as regras sociais ou chegue atrasado; isso os frustra."
        ],
        "Friendships": "Os Executivos valorizam amizades baseadas em valores compartilhados e ética de trabalho. Embora possam ter princípios fortes, formam laços por meio de interesses comuns, hobbies e rotinas. Eles priorizam a lealdade e adoram organizar eventos para atividades em grupo, garantindo que todos aproveitem o tempo juntos.",
        "CareerPath": [
          "Auditor",
          "Piloto comercial",
          "Reparador de computadores",
          "Gerente de construção",
          "Agente penitenciário",
          "Investigador criminal",
          "Auxiliar de saúde domiciliar",
          "Consultor financeiro pessoal",
          "Despachante de polícia, bombeiros e ambulâncias",
          "Xerife e subxerife"
        ],
        "LifeValue": [
          "Casa/Família",
          "Saúde",
          "Segurança financeira",
          "Realização",
          "Amizades"
        ],
        "CompatibleConnections": [
          "O Lógico (ISTJ)",
          "O Virtuoso (ISTP)",
          "O Aventureiro (ISFP)"
        ],
        "HasPotentialConnections": [
          "O Pensador (INTP)",
          "O Advogado (INFJ)",
          "O Mediador (INFP)",
          "O Cônsul (ESFJ)",
          "O Performador (ESFP)",
          "O Defensor (ISFJ)",
          "O Dinâmico (ESTP)"
        ],
        "ChallengingConnections": [
          "O Arquiteto (INTJ)",
          "O Campanha (ENFP)",
          "O Debatedor (ENTP)",
          "O Protagonista (ENFJ)",
          "O Comandante (ENTJ)",
          "O Executivo (ESTJ)"
        ],
        "AttractedBy": [
          "Suave e gentil",
          "Caloroso",
          "Atencioso",
          "Confiável",
          "Responsável",
          "Detalhista",
          "Honesto",
          "Consciente do dever",
          "Lógico",
          "Descontraído"
        ],
        "PetPeeves": [
          "Atrasado",
          "Incompetente",
          "Pouco detalhista",
          "Emocional demais",
          "Ilógico",
          "Irresponsável",
          "Preguiçoso",
          "Desorganizado",
          "Reclamão",
          "Queixoso",
          "Irrespeitoso",
          "Inconstante",
          "Procrastinador"
        ],
        "HowToBeCompanion": [
          "Seja organizado e tome a iniciativa em suas responsabilidades compartilhadas.",
          "Mostre respeito pelas qualidades de liderança deles, mas não tenha medo de oferecer sua opinião.",
          "Ofereça soluções práticas em vez de respostas emocionais aos problemas.",
          "Seja direto e honesto na comunicação – eles apreciam a clareza.",
          "Respeite a necessidade deles de estrutura e estabilidade na vida.",
          "Apoie suas ambições e demonstre seu próprio empenho e compromisso."
        ],
        "SecretDesire": "Os Executivos parecem lógicos e diretos, mas no fundo desejam realização pessoal por meio de contribuições significativas. Eles muitas vezes anseiam por fazer um impacto positivo além do sucesso profissional, buscando se conectar com causas beneficentes ou sociais que tragam propósito a suas vidas.",
        "Stereotypes": "Muitos confundem os Executivos com pessoas controladoras ou excessivamente preocupadas com regras. Na realidade, eles se preocupam profundamente em ajudar os outros e estão dispostos a ir além para aqueles que amam. Essas personalidades equilibram sua abordagem estruturada da vida com um desejo genuíno de melhorar o mundo ao seu redor.",
        "Celebrities": [
          "Mansa Musa",
          "Mobutu Sese Seko",
          "Serena Williams",
          "Michelle Obama",
          "Dr. Phil McGraw",
          "Hillary Clinton",
          "Saddam Hussein",
          "Emma Watson",
          "Rose Kennedy",
          "Ivanka Trump",
          "Nancy Grace"
        ]
      },
      {
        "id": 7,
        "language_code": "ar",
        "type": "ESTJ",
        "name": "المدير التنفيذي",
        "Description": "المديرون التنفيذيون هم منظِّمون طبيعيون، معروفون بقيادتهم القوية وإحساسهم بالواجب. إنهم يقدرون النظام والانضباط والكفاءة، ويسعون دائمًا لخلق الاستقرار في بيئاتهم. وعلى الرغم من أنهم يُرَون أحيانًا على أنهم صارمون، فإن تفانيهم في القيام بما هو صحيح يجعلهم جديرين بالثقة والاعتماد عليهم. يبحثون عن حلول عملية ولديهم إحساس قوي بالمسؤولية، مما يدفعهم لتولي زمام الأمور في معظم المواقف.",
        "Strengths": [
          "مخلص",
          "قوي الإرادة",
          "صريح وصادق",
          "وفي",
          "صبور",
          "موثوق",
          "يحبون خلق النظام",
          "منظمون بارعون"
        ],
        "Weaknesses": [
          "غير مرن وعنيد",
          "غير مرتاح في المواقف غير التقليدية",
          "سريع الحكم",
          "مفرط التركيز على المكانة الاجتماعية",
          "صعوبة في الاسترخاء",
          "صعوبة في التعبير عن العواطف"
        ],
        "DosInRelationship": [
          "كن لطيفًا وودودًا – يقدرون اللطف الذي يوازن قوتهم.",
          "دعهم يتولون القيادة؛ يستمتعون بأن يكونوا القادة.",
          "أظهر أنك جدير بالثقة من خلال الوفاء بوعودك – سيحترمون ذلك.",
          "كن صادقًا وواضحًا في التواصل؛ تجنب الدراما العاطفية.",
          "ساعدهم في المهام العملية – يقدرون الإيماءات الملموسة.",
          "احترم مساحتهم ووقتهم مع العائلة والأصدقاء."
        ],
        "DontsInRelationship": [
          "تجنب الألعاب التلاعبية والسلوك غير الصادق؛ إنه ينفرهم.",
          "لا تكن جنسيًا جدًا في وقت مبكر؛ يقدرون ضبط النفس.",
          "لا تكن كسولًا أو غير منظم.",
          "تجنب الضغط عليهم للانفتاح عاطفيًا قبل أن يكونوا مستعدين.",
          "لا تتجاهل القواعد الاجتماعية أو تتأخر؛ هذا يزعجهم."
        ],
        "Friendships": "يقدر المديرون التنفيذيون الصداقات المبنية على القيم المشتركة وأخلاقيات العمل. وعلى الرغم من أنهم قد يكونون مبدئيين للغاية، فإنهم يشكلون روابط من خلال الاهتمامات المشتركة والهوايات والروتينات. إنهم يعطون الأولوية للولاء ويحبون تنظيم الفعاليات للأنشطة الجماعية، لضمان استمتاع الجميع بالوقت معًا.",
        "CareerPath": [
          "مراجع حسابات",
          "طيار تجاري",
          "فني إصلاح أجهزة الكمبيوتر",
          "مدير البناء",
          "ضابط سجون",
          "محقق جنائي",
          "مساعد صحي منزلي",
          "مستشار مالي شخصي",
          "موزع شرطة، إطفاء وإسعاف",
          "عمدة ونائب عمدة"
        ],
        "LifeValue": [
          "الأسرة",
          "الصحة",
          "الأمان المالي",
          "الإنجاز",
          "الصداقات"
        ],
        "CompatibleConnections": [
          "اللوجستي (ISTJ)",
          "المبدع (ISTP)",
          "المغامر (ISFP)"
        ],
        "HasPotentialConnections": [
          "المفكر (INTP)",
          "المحامي (INFJ)",
          "الوسيط (INFP)",
          "القنصل (ESFJ)",
          "المؤدي (ESFP)",
          "المدافع (ISFJ)",
          "الدينامو (ESTP)"
        ],
        "ChallengingConnections": [
          "المهندس المعماري (INTJ)",
          "المروج (ENFP)",
          "المناظر (ENTP)",
          "البطل (ENFJ)",
          "القائد (ENTJ)",
          "المدير التنفيذي (ESTJ)"
        ],
        "AttractedBy": [
          "لطيف وودود",
          "دافئ",
          "مراعي",
          "موثوق",
          "مسؤول",
          "دقيق",
          "صادق",
          "مخلص",
          "منطقي",
          "مسترخي"
        ],
        "PetPeeves": [
          "متأخر",
          "غير كفء",
          "غير دقيق",
          "عاطفي جدًا",
          "غير منطقي",
          "غير مسؤول",
          "كسول",
          "غير منظم",
          "كثير الشكوى",
          "متعجرف",
          "غير محترم",
          "متقلب",
          "مماطل"
        ],
        "HowToBeCompanion": [
          "كن منظمًا واتخذ المبادرة في مسؤولياتك المشتركة.",
          "أظهر الاحترام لصفات قيادتهم، لكن لا تخف من تقديم مدخلاتك.",
          "قدم حلولًا عملية بدلاً من الاستجابات العاطفية للمشكلات.",
          "كن صريحًا وصادقًا في التواصل – يقدرون الوضوح.",
          "احترم حاجتهم إلى الهيكلية والاستقرار في الحياة.",
          "ادعم طموحاتهم وأظهر تفانيك والتزامك الشخصي."
        ],
        "SecretDesire": "يبدو المديرون التنفيذيون منطقيين ومباشرين، لكن في أعماقهم يتوقون إلى الإشباع الشخصي من خلال المساهمات ذات المعنى. غالبًا ما يرغبون في إحداث تأثير إيجابي يتجاوز النجاح المهني، ويطمحون إلى التواصل من خلال القضايا الخيرية أو الاجتماعية التي تضفي معنى لحياتهم.",
        "Stereotypes": "غالبًا ما يُخطئ الناس في فهم المديرين التنفيذيين على أنهم مفرطون في التحكم أو مهتمون بالقواعد فقط. لكن في الواقع، يهتمون بعمق بمساعدة الآخرين ومستعدون لتقديم المزيد لمن يحبونهم. هذه الشخصيات توازن بين نهجهم المنظم في الحياة ورغبة حقيقية في تحسين العالم من حولهم.",
        "Celebrities": [
          "مانسا موسى",
          "موبوتو سيسي سيكو",
          "سيرينا ويليامز",
          "ميشيل أوباما",
          "الدكتور فيل مكغرو",
          "هيلاري كلينتون",
          "صدام حسين",
          "إيما واتسون",
          "روز كينيدي",
          "إيفانكا ترامب",
          "نانسي غريس"
        ]
      }      
    ]
  }  