{
    "personalities": [
      {
        "id": 8,
        "language_code": "en",
        "type": "ISTJ",
        "name": "The Logistician",
        "Description": "Logisticians are highly dependable and responsible individuals known for their attention to detail and strong sense of duty. They value tradition, stability, and order, preferring well-established methods and systems over unpredictability. Logical and efficient, Logisticians are excellent planners and are driven by a need to maintain consistency. Their practicality makes them reliable, though they may come off as reserved or overly serious. In relationships, Logisticians seek loyalty and trust, building solid foundations based on mutual respect and clear expectations.",
        "Strengths": [
          "Loyal",
          "Honest and direct",
          "Practical and calm",
          "Persevering",
          "Detailed",
          "Strong-willed and dutiful",
          "Responsible",
          "Methodical",
          "Jacks-of-all-trades",
          "Orderly"
        ],
        "Weaknesses": [
          "Insensitive",
          "Stubborn",
          "Always by the book",
          "Change-resistant",
          "Judgmental",
          "Blame themselves too much",
          "Rigid in thinking"
        ],
        "DosInRelationship": [
          "Pay attention to how you present yourself; they appreciate neatness and order.",
          "Stick to plans; uncertainty can cause them stress.",
          "Be polite and respect their personal space.",
          "Communicate clearly and directly; they value straightforwardness.",
          "Help with practical needs or small gestures of kindness.",
          "Encourage them to relax and have fun when appropriate.",
          "Show you care about details, especially in what they care for.",
          "Be on time and dependable.",
          "Listen attentively."
        ],
        "DontsInRelationship": [
          "Don’t embarrass them in public; it will haunt them later.",
          "Avoid unclear or unrealistic conversations.",
          "Don’t pressure them into being overly social.",
          "Breaking promises undermines their trust.",
          "Don’t be late for dates or meetings.",
          "Avoid being overly emotional in discussions.",
          "Don’t give the impression of being lazy or messy.",
          "Avoid pressuring them to express emotions too soon.",
          "Respect their sense of order and social norms.",
          "Don’t create uncertainty with frequent surprises."
        ],
        "Friendships": "Logisticians value loyalty and long-term connections in friendships. Though it may take time for them to open up, once someone is part of their circle, they remain fiercely loyal. Their friendships are built on trust and shared experiences, and while they may not be expressive with words, they show their dedication through unwavering support and reliability.",
        "CareerPath": [
          "Accountant",
          "Air Traffic Controller",
          "Aircraft Mechanic/Service Technician",
          "Civil Engineer",
          "Environmental Science & Protection Tech",
          "Nuclear Power Reactor Operator",
          "Security Guard",
          "Supervisor of Correctional Officers",
          "Tax Examiner, Collector, Revenue Agent",
          "Transportation Inspector"
        ],
        "LifeValue": [
          "Home/Family",
          "Financial Security",
          "Health",
          "Autonomy",
          "Achievement"
        ],
        "CompatibleConnections": [
          "The Executive (ESTJ)",
          "The Dynamo (ESTP)",
          "The Performer (ESFP)"
        ],
        "HasPotentialConnections": [
          "The Debater (ENTP)",
          "The Campaigner (ENFP)",
          "The Consul (ESFJ)",
          "The Defender (ISFJ)",
          "The Adventurer (ISFP)",
          "The Virtuoso (ISTP)"
        ],
        "ChallengingConnections": [
          "The Advocate (INFJ)",
          "The Architect (INTJ)",
          "The Mediator (INFP)",
          "The Protagonist (ENFJ)",
          "The Thinker (INTP)",
          "The Commander (ENTJ)",
          "The Logistician (ISTJ)"
        ],
        "AttractedBy": [
          "Fun",
          "Outgoing",
          "Honest",
          "Warm",
          "Dependable",
          "Responsible",
          "Authentic",
          "Committed",
          "Adventurous",
          "Practical",
          "Realistic",
          "Detailed"
        ],
        "PetPeeves": [
          "Overemotional",
          "Unreliable",
          "Flaky",
          "Manipulative",
          "Tardy",
          "Unpredictable",
          "Undependable",
          "Irrational",
          "Insincere",
          "Gossipy",
          "Invasive",
          "Disorganized",
          "Passive-aggressive"
        ],
        "HowToBeCompanion": [
          "Be reliable and consistent—they appreciate people they can count on.",
          "Respect their routines and plans; sudden changes can be unsettling for them.",
          "Show your love through practical and tangible actions.",
          "Be honest and straightforward; they value integrity above all.",
          "Give them space for their alone time, but remind them you're there for them.",
          "Demonstrate your loyalty, and they’ll be loyal in return."
        ],
        "SecretDesire": "Though Logisticians seem structured and traditional, they sometimes long for spontaneity and adventure. In private, they may explore new ideas or imagine different scenarios. While this side may be hidden from most, close friends may witness their quirky, whimsical nature. This side often emerges when they feel safe from judgment. Despite this, they usually return to their more predictable, responsible selves.",
        "Stereotype": "Logisticians are often seen as overly obsessed with rules and regulations, lacking emotional depth. However, beneath their reserved exterior lies a caring heart, especially for those they hold dear. Although they may not always show it, Logisticians are the type to stand by their loved ones, offering unwavering support and reliability through thick and thin.",
        "Celebrities": [
          "George Washington",
          "Queen Elizabeth II",
          "Henry Ford",
          "Jeff Bezos",
          "Evander Holyfield",
          "Julia Roberts",
          "Denzel Washington",
          "Morgan Freeman",
          "Warren Buffet",
          "Natalie Portman",
          "Robert De Niro"
        ]
      },
      {
        "id": 8,
        "language_code": "fr",
        "type": "ISTJ",
        "name": "Le Logisticien",
        "Description": "Les Logisticiens sont des individus très fiables et responsables, connus pour leur attention aux détails et leur fort sens du devoir. Ils valorisent la tradition, la stabilité et l'ordre, préférant les méthodes et systèmes bien établis à l'imprévisibilité. Logiques et efficaces, les Logisticiens sont d'excellents planificateurs et sont motivés par le besoin de maintenir la cohérence. Leur côté pratique les rend fiables, bien qu'ils puissent paraître réservés ou trop sérieux. Dans les relations, les Logisticiens recherchent la loyauté et la confiance, en construisant des bases solides basées sur le respect mutuel et des attentes claires.",
        "Strengths": [
          "Loyal",
          "Honnête et direct",
          "Pratique et calme",
          "Persévérant",
          "Détaillé",
          "Déterminé et consciencieux",
          "Responsable",
          "Méthodique",
          "Polyvalent",
          "Ordonné"
        ],
        "Weaknesses": [
          "Insensible",
          "Têtu",
          "Toujours rigide dans les règles",
          "Résistant au changement",
          "Juge rapidement",
          "Se blâme trop",
          "Rigide dans la pensée"
        ],
        "DosInRelationship": [
          "Faites attention à votre apparence; ils apprécient la propreté et l'ordre.",
          "Respectez les plans; l'incertitude peut leur causer du stress.",
          "Soyez poli et respectez leur espace personnel.",
          "Communiquez clairement et directement; ils apprécient la simplicité.",
          "Aidez aux besoins pratiques ou montrez de la gentillesse par de petits gestes.",
          "Encouragez-les à se détendre et à s'amuser quand c'est approprié.",
          "Montrez que vous vous souciez des détails, surtout de ce qu'ils chérissent.",
          "Soyez ponctuel et fiable.",
          "Écoutez attentivement."
        ],
        "DontsInRelationship": [
          "Ne les embarrassez pas en public; cela les hantera plus tard.",
          "Évitez les conversations floues ou irréalistes.",
          "Ne les forcez pas à être trop sociables.",
          "Rompre des promesses sape leur confiance.",
          "Ne soyez pas en retard pour les rendez-vous ou réunions.",
          "Évitez d'être trop émotionnel dans les discussions.",
          "Ne donnez pas l'impression d'être paresseux ou désordonné.",
          "Évitez de les pousser à exprimer des émotions trop tôt.",
          "Respectez leur sens de l'ordre et des normes sociales.",
          "Ne créez pas d'incertitude avec des surprises fréquentes."
        ],
        "Friendships": "Les Logisticiens valorisent la loyauté et les connexions à long terme dans leurs amitiés. Bien qu'il puisse leur falloir du temps pour s'ouvrir, une fois que quelqu'un fait partie de leur cercle, ils restent farouchement loyaux. Leurs amitiés sont construites sur la confiance et les expériences partagées, et bien qu'ils ne soient pas toujours expressifs avec les mots, ils montrent leur dévouement par un soutien indéfectible et une fiabilité constante.",
        "CareerPath": [
          "Comptable",
          "Contrôleur de la circulation aérienne",
          "Mécanicien/technicien d'aéronefs",
          "Ingénieur civil",
          "Technicien en sciences de l'environnement et en protection",
          "Opérateur de réacteur nucléaire",
          "Agent de sécurité",
          "Superviseur des agents correctionnels",
          "Inspecteur des impôts, collecteur, agent du revenu",
          "Inspecteur des transports"
        ],
        "LifeValue": [
          "Maison/Famille",
          "Sécurité financière",
          "Santé",
          "Autonomie",
          "Réussite"
        ],
        "CompatibleConnections": [
          "L'Exécutif (ESTJ)",
          "Le Dynamique (ESTP)",
          "Le Performeur (ESFP)"
        ],
        "HasPotentialConnections": [
          "Le Débatteur (ENTP)",
          "Le Campagneur (ENFP)",
          "Le Consul (ESFJ)",
          "Le Défenseur (ISFJ)",
          "L'Aventurier (ISFP)",
          "Le Virtuose (ISTP)"
        ],
        "ChallengingConnections": [
          "L'Avocat (INFJ)",
          "L'Architecte (INTJ)",
          "Le Médiateur (INFP)",
          "Le Protagoniste (ENFJ)",
          "Le Penseur (INTP)",
          "Le Commandant (ENTJ)",
          "Le Logisticien (ISTJ)"
        ],
        "AttractedBy": [
          "Amusant",
          "Extraverti",
          "Honnête",
          "Chaleureux",
          "Fiable",
          "Responsable",
          "Authentique",
          "Engagé",
          "Aventurier",
          "Pratique",
          "Réaliste",
          "Détaillé"
        ],
        "PetPeeves": [
          "Trop émotionnel",
          "Non fiable",
          "Instable",
          "Manipulateur",
          "Retardataire",
          "Imprévisible",
          "Peu digne de confiance",
          "Irrationnel",
          "Non sincère",
          "Commérages",
          "Intrusif",
          "Désorganisé",
          "Passif-agressif"
        ],
        "HowToBeCompanion": [
          "Soyez fiable et cohérent – ils apprécient les personnes sur qui ils peuvent compter.",
          "Respectez leurs routines et leurs plans; les changements soudains peuvent les perturber.",
          "Montrez votre amour par des actions pratiques et tangibles.",
          "Soyez honnête et direct; ils valorisent l'intégrité avant tout.",
          "Donnez-leur de l'espace pour leur temps seul, mais rappelez-leur que vous êtes là pour eux.",
          "Montrez votre loyauté, et ils vous seront fidèles en retour."
        ],
        "SecretDesire": "Bien que les Logisticiens semblent structurés et traditionnels, ils aspirent parfois à la spontanéité et à l'aventure. En privé, ils peuvent explorer de nouvelles idées ou imaginer différents scénarios. Bien que ce côté soit souvent caché pour la plupart des gens, les amis proches peuvent parfois voir leur nature excentrique et fantaisiste. Cependant, ils reviennent généralement à leur moi plus prévisible et responsable.",
        "Stereotype": "Les Logisticiens sont souvent perçus comme obsédés par les règles et les réglementations, manquant de profondeur émotionnelle. Cependant, derrière leur façade réservée se cache un cœur attentionné, surtout envers ceux qui leur sont chers. Bien qu'ils ne le montrent pas toujours, les Logisticiens sont du genre à rester aux côtés de leurs proches, offrant un soutien indéfectible et une fiabilité à toute épreuve.",
        "Celebrities": [
          "George Washington",
          "Reine Elizabeth II",
          "Henry Ford",
          "Jeff Bezos",
          "Evander Holyfield",
          "Julia Roberts",
          "Denzel Washington",
          "Morgan Freeman",
          "Warren Buffet",
          "Natalie Portman",
          "Robert De Niro"
        ]
      },
      {
        "id": 8,
        "language_code": "es",
        "type": "ISTJ",
        "name": "El Logístico",
        "Description": "Los Logísticos son individuos muy confiables y responsables, conocidos por su atención al detalle y su fuerte sentido del deber. Valoran la tradición, la estabilidad y el orden, prefiriendo métodos y sistemas bien establecidos en lugar de la imprevisibilidad. Lógicos y eficientes, los Logísticos son excelentes planificadores y están impulsados por la necesidad de mantener la coherencia. Su sentido práctico los hace confiables, aunque a veces pueden parecer reservados o demasiado serios. En las relaciones, los Logísticos buscan lealtad y confianza, construyendo bases sólidas basadas en el respeto mutuo y expectativas claras.",
        "Strengths": [
          "Leal",
          "Honesto y directo",
          "Práctico y tranquilo",
          "Perseverante",
          "Detallista",
          "Decidido y responsable",
          "Responsable",
          "Metódico",
          "Polifacético",
          "Ordenado"
        ],
        "Weaknesses": [
          "Insensible",
          "Terco",
          "Demasiado apegado a las reglas",
          "Resistente al cambio",
          "Juzga rápidamente",
          "Se culpa demasiado",
          "Rígido en su pensamiento"
        ],
        "DosInRelationship": [
          "Presta atención a tu apariencia; aprecian la pulcritud y el orden.",
          "Respeta los planes; la incertidumbre puede causarles estrés.",
          "Sé educado y respeta su espacio personal.",
          "Comunica claramente y de forma directa; valoran la simplicidad.",
          "Ayuda con necesidades prácticas o pequeños gestos de amabilidad.",
          "Anímalos a relajarse y divertirse cuando sea apropiado.",
          "Demuestra que te importan los detalles, especialmente en lo que les importa.",
          "Sé puntual y confiable.",
          "Escucha atentamente."
        ],
        "DontsInRelationship": [
          "No los avergüences en público; les atormentará más tarde.",
          "Evita conversaciones poco claras o irreales.",
          "No los presiones para ser demasiado sociables.",
          "Romper promesas mina su confianza.",
          "No llegues tarde a las citas o reuniones.",
          "Evita ser demasiado emocional en las discusiones.",
          "No des la impresión de ser perezoso o desordenado.",
          "No los presiones para expresar emociones demasiado pronto.",
          "Respeta su sentido del orden y las normas sociales.",
          "No crees incertidumbre con sorpresas frecuentes."
        ],
        "Friendships": "Los Logísticos valoran la lealtad y las conexiones a largo plazo en sus amistades. Aunque les pueda llevar tiempo abrirse, una vez que alguien forma parte de su círculo, son ferozmente leales. Sus amistades se construyen sobre la confianza y las experiencias compartidas, y aunque no siempre sean expresivos con las palabras, demuestran su dedicación a través de su apoyo inquebrantable y su confiabilidad constante.",
        "CareerPath": [
          "Contador",
          "Controlador de tráfico aéreo",
          "Mecánico de aeronaves",
          "Ingeniero civil",
          "Técnico en ciencias ambientales y protección",
          "Operador de reactor nuclear",
          "Guardia de seguridad",
          "Supervisor de oficiales correccionales",
          "Inspector de impuestos, recaudador, agente de ingresos",
          "Inspector de transporte"
        ],
        "LifeValue": [
          "Hogar/Familia",
          "Seguridad financiera",
          "Salud",
          "Autonomía",
          "Logro"
        ],
        "CompatibleConnections": [
          "El Ejecutivo (ESTJ)",
          "El Dinámico (ESTP)",
          "El Intérprete (ESFP)"
        ],
        "HasPotentialConnections": [
          "El Debatidor (ENTP)",
          "El Campañero (ENFP)",
          "El Cónsul (ESFJ)",
          "El Defensor (ISFJ)",
          "El Aventurero (ISFP)",
          "El Virtuoso (ISTP)"
        ],
        "ChallengingConnections": [
          "El Abogado (INFJ)",
          "El Arquitecto (INTJ)",
          "El Mediador (INFP)",
          "El Protagonista (ENFJ)",
          "El Pensador (INTP)",
          "El Comandante (ENTJ)",
          "El Logístico (ISTJ)"
        ],
        "AttractedBy": [
          "Divertido",
          "Extrovertido",
          "Honesto",
          "Cariñoso",
          "Confiable",
          "Responsable",
          "Auténtico",
          "Comprometido",
          "Aventurero",
          "Práctico",
          "Realista",
          "Detallista"
        ],
        "PetPeeves": [
          "Demasiado emocional",
          "No confiable",
          "Indeciso",
          "Manipulador",
          "Impuntual",
          "Impredecible",
          "Poco confiable",
          "Irracional",
          "Insincero",
          "Chismoso",
          "Intrusivo",
          "Desorganizado",
          "Pasivo-agresivo"
        ],
        "HowToBeCompanion": [
          "Sé confiable y consistente; aprecian a las personas en las que pueden confiar.",
          "Respeta sus rutinas y planes; los cambios repentinos pueden inquietarlos.",
          "Demuestra tu amor a través de acciones prácticas y tangibles.",
          "Sé honesto y directo; valoran la integridad por encima de todo.",
          "Dales espacio para su tiempo a solas, pero recuérdales que estás ahí para ellos.",
          "Demuestra tu lealtad, y ellos serán leales a ti."
        ],
        "SecretDesire": "Aunque los Logísticos parecen estructurados y tradicionales, a veces anhelan la espontaneidad y la aventura. En privado, pueden explorar nuevas ideas o imaginar diferentes escenarios. Aunque este lado puede estar oculto para la mayoría, los amigos cercanos pueden presenciar su naturaleza excéntrica y caprichosa. Sin embargo, generalmente regresan a su yo más predecible y responsable.",
        "Stereotype": "Los Logísticos a menudo son vistos como demasiado obsesionados con las reglas y regulaciones, faltos de profundidad emocional. Sin embargo, detrás de su exterior reservado se esconde un corazón cariñoso, especialmente por aquellos que más quieren. Aunque no siempre lo demuestren, los Logísticos son del tipo que permanece al lado de sus seres queridos, ofreciendo un apoyo inquebrantable y confiabilidad en todo momento.",
        "Celebrities": [
          "George Washington",
          "Reina Isabel II",
          "Henry Ford",
          "Jeff Bezos",
          "Evander Holyfield",
          "Julia Roberts",
          "Denzel Washington",
          "Morgan Freeman",
          "Warren Buffet",
          "Natalie Portman",
          "Robert De Niro"
        ]
      },
      {
        "id": 8,
        "language_code": "pt",
        "type": "ISTJ",
        "name": "O Logístico",
        "Description": "Os Logísticos são indivíduos altamente confiáveis e responsáveis, conhecidos por sua atenção aos detalhes e forte senso de dever. Eles valorizam a tradição, a estabilidade e a ordem, preferindo métodos e sistemas bem estabelecidos à imprevisibilidade. Lógicos e eficientes, os Logísticos são excelentes planejadores e são movidos pela necessidade de manter a consistência. Sua praticidade os torna confiáveis, embora possam parecer reservados ou excessivamente sérios. Nos relacionamentos, os Logísticos buscam lealdade e confiança, construindo bases sólidas baseadas no respeito mútuo e em expectativas claras.",
        "Strengths": [
          "Leal",
          "Honesto e direto",
          "Prático e calmo",
          "Perseverante",
          "Detalhista",
          "Determinado e consciencioso",
          "Responsável",
          "Metódico",
          "Versátil",
          "Organizado"
        ],
        "Weaknesses": [
          "Insensível",
          "Teimoso",
          "Sempre segue as regras",
          "Resistente à mudança",
          "Julgador",
          "Culpam-se demais",
          "Rígido no pensamento"
        ],
        "DosInRelationship": [
          "Preste atenção à sua aparência; eles apreciam a organização e a ordem.",
          "Siga os planos; a incerteza pode causar-lhes estresse.",
          "Seja educado e respeite o espaço pessoal deles.",
          "Comunique-se claramente e de forma direta; eles valorizam a simplicidade.",
          "Ajude com necessidades práticas ou pequenos gestos de bondade.",
          "Incentive-os a relaxar e se divertir quando for apropriado.",
          "Mostre que você se importa com os detalhes, especialmente com o que eles valorizam.",
          "Seja pontual e confiável.",
          "Ouça atentamente."
        ],
        "DontsInRelationship": [
          "Não os envergonhe em público; isso os perseguirá mais tarde.",
          "Evite conversas pouco claras ou irreais.",
          "Não os pressione a serem excessivamente sociais.",
          "Quebrar promessas abala a confiança deles.",
          "Não chegue atrasado a encontros ou reuniões.",
          "Evite ser muito emocional nas discussões.",
          "Não dê a impressão de ser preguiçoso ou desorganizado.",
          "Não os pressione a expressar emoções muito cedo.",
          "Respeite seu senso de ordem e normas sociais.",
          "Não crie incerteza com surpresas frequentes."
        ],
        "Friendships": "Os Logísticos valorizam a lealdade e conexões duradouras nas amizades. Embora possam demorar a se abrir, uma vez que alguém faz parte do círculo deles, permanecem ferozmente leais. Suas amizades são construídas com base na confiança e experiências compartilhadas, e, embora não sejam sempre expressivos com palavras, demonstram dedicação através de apoio inabalável e confiabilidade constante.",
        "CareerPath": [
          "Contador",
          "Controlador de tráfego aéreo",
          "Mecânico de aeronaves",
          "Engenheiro civil",
          "Técnico em ciências ambientais e proteção",
          "Operador de reator nuclear",
          "Agente de segurança",
          "Supervisor de oficiais correcionais",
          "Inspetor de impostos, cobrador, agente de receitas",
          "Inspetor de transporte"
        ],
        "LifeValue": [
          "Casa/Família",
          "Segurança financeira",
          "Saúde",
          "Autonomia",
          "Realização"
        ],
        "CompatibleConnections": [
          "O Executivo (ESTJ)",
          "O Dinâmico (ESTP)",
          "O Intérprete (ESFP)"
        ],
        "HasPotentialConnections": [
          "O Debatedor (ENTP)",
          "O Campanha (ENFP)",
          "O Cônsul (ESFJ)",
          "O Defensor (ISFJ)",
          "O Aventureiro (ISFP)",
          "O Virtuoso (ISTP)"
        ],
        "ChallengingConnections": [
          "O Advogado (INFJ)",
          "O Arquiteto (INTJ)",
          "O Mediador (INFP)",
          "O Protagonista (ENFJ)",
          "O Pensador (INTP)",
          "O Comandante (ENTJ)",
          "O Logístico (ISTJ)"
        ],
        "AttractedBy": [
          "Divertido",
          "Extrovertido",
          "Honesto",
          "Caloroso",
          "Confiável",
          "Responsável",
          "Autêntico",
          "Comprometido",
          "Aventureiro",
          "Prático",
          "Realista",
          "Detalhista"
        ],
        "PetPeeves": [
          "Excessivamente emocional",
          "Não confiável",
          "Indeciso",
          "Manipulador",
          "Impontual",
          "Imprevisível",
          "Inconstante",
          "Irracional",
          "Não sincero",
          "Fofoqueiro",
          "Invasivo",
          "Desorganizado",
          "Passivo-agressivo"
        ],
        "HowToBeCompanion": [
          "Seja confiável e consistente – eles apreciam pessoas nas quais podem confiar.",
          "Respeite suas rotinas e planos; mudanças repentinas podem ser perturbadoras para eles.",
          "Mostre seu amor através de ações práticas e tangíveis.",
          "Seja honesto e direto; eles valorizam a integridade acima de tudo.",
          "Dê-lhes espaço para seu tempo sozinho, mas lembre-os de que você está lá para eles.",
          "Demonstre sua lealdade, e eles serão leais em troca."
        ],
        "SecretDesire": "Embora os Logísticos pareçam estruturados e tradicionais, às vezes anseiam por espontaneidade e aventura. Em particular, podem explorar novas ideias ou imaginar diferentes cenários. Embora esse lado esteja escondido da maioria, amigos próximos podem testemunhar sua natureza excêntrica e caprichosa. No entanto, eles geralmente retornam ao seu eu mais previsível e responsável.",
        "Stereotype": "Os Logísticos são frequentemente vistos como obcecados por regras e regulamentos, faltando profundidade emocional. No entanto, por trás de seu exterior reservado, há um coração atencioso, especialmente com aqueles que mais amam. Embora não demonstrem sempre, os Logísticos são do tipo que permanecem ao lado de seus entes queridos, oferecendo apoio inabalável e confiabilidade em todos os momentos.",
        "Celebrities": [
          "George Washington",
          "Rainha Elizabeth II",
          "Henry Ford",
          "Jeff Bezos",
          "Evander Holyfield",
          "Julia Roberts",
          "Denzel Washington",
          "Morgan Freeman",
          "Warren Buffet",
          "Natalie Portman",
          "Robert De Niro"
        ]
      },
      {
        "id": 8,
        "language_code": "ar",
        "type": "ISTJ",
        "name": "اللوجستي",
        "Description": "اللوجستيون هم أفراد يمكن الاعتماد عليهم للغاية ومسؤولون، معروفون باهتمامهم بالتفاصيل وإحساسهم القوي بالواجب. يقدرون التقاليد والاستقرار والنظام، مفضلين الطرق والأنظمة الراسخة على عدم التوقع. منطقيون وفعالون، اللوجستيون مخططون ممتازون ويحفزهم الحاجة للحفاظ على التناسق. تجعلهم عقلانيتهم موثوقين، رغم أنهم قد يظهرون على أنهم محجوزون أو جديون بشكل مفرط. في العلاقات، يبحث اللوجستيون عن الولاء والثقة، ويبنون أسسًا قوية قائمة على الاحترام المتبادل وتوقعات واضحة.",
        "Strengths": [
          "مخلص",
          "صادق ومباشر",
          "عملي وهادئ",
          "مثابر",
          "دقيق",
          "قوي الإرادة وملتزم بالواجب",
          "مسؤول",
          "منهجي",
          "متعدد المهارات",
          "منظم"
        ],
        "Weaknesses": [
          "غير حساس",
          "عنيد",
          "يتبع القواعد دائمًا",
          "مقاوم للتغيير",
          "انتقادي",
          "يلومون أنفسهم كثيرًا",
          "متحجر في التفكير"
        ],
        "DosInRelationship": [
          "انتبه إلى مظهرك؛ يقدرون النظافة والنظام.",
          "التزم بالخطط؛ عدم اليقين يمكن أن يسبب لهم التوتر.",
          "كن مهذبًا واحترم مساحتهم الشخصية.",
          "تواصل بوضوح وبشكل مباشر؛ يقدرون البساطة.",
          "ساعد في الاحتياجات العملية أو بلفتات صغيرة من اللطف.",
          "شجعهم على الاسترخاء والاستمتاع عند الضرورة.",
          "أظهر اهتمامك بالتفاصيل، خاصة فيما يهمهم.",
          "كن دقيقًا ويمكن الاعتماد عليك.",
          "استمع باهتمام."
        ],
        "DontsInRelationship": [
          "لا تحرجهم في الأماكن العامة؛ سيؤثر ذلك عليهم لاحقًا.",
          "تجنب المحادثات غير الواضحة أو غير الواقعية.",
          "لا تضغط عليهم ليكونوا اجتماعيين بشكل مفرط.",
          "كسر الوعود يقوض ثقتهم.",
          "لا تتأخر في المواعيد أو الاجتماعات.",
          "تجنب الانفعالات الزائدة في المناقشات.",
          "لا تعطي انطباعًا بأنك كسول أو غير منظم.",
          "تجنب الضغط عليهم للتعبير عن مشاعرهم في وقت مبكر جدًا.",
          "احترم إحساسهم بالنظام والمعايير الاجتماعية.",
          "لا تخلق حالة من عدم اليقين بالمفاجآت المتكررة."
        ],
        "Friendships": "يقدر اللوجستيون الولاء والروابط طويلة الأمد في الصداقات. رغم أنه قد يستغرقهم بعض الوقت للانفتاح، إلا أنه بمجرد أن يصبح شخص ما جزءًا من دائرتهم، يظلون أوفياء بشدة. تُبنى صداقاتهم على الثقة والتجارب المشتركة، ورغم أنهم قد لا يكونون دائمًا معبرين بالكلمات، فإنهم يظهرون تفانيهم من خلال الدعم الثابت والموثوقية المستمرة.",
        "CareerPath": [
          "محاسب",
          "مراقب الحركة الجوية",
          "ميكانيكي/فني طائرات",
          "مهندس مدني",
          "فني علوم البيئة والحماية",
          "مشغل مفاعل نووي",
          "حارس أمن",
          "مشرف ضباط الإصلاحيات",
          "محقق ضرائب، جامع، وكيل الإيرادات",
          "مفتش النقل"
        ],
        "LifeValue": [
          "الأسرة/المنزل",
          "الأمن المالي",
          "الصحة",
          "الاستقلالية",
          "الإنجاز"
        ],
        "CompatibleConnections": [
          "المدير التنفيذي (ESTJ)",
          "الدينامي (ESTP)",
          "المؤدي (ESFP)"
        ],
        "HasPotentialConnections": [
          "المناقش (ENTP)",
          "المروج (ENFP)",
          "القنصل (ESFJ)",
          "المدافع (ISFJ)",
          "المغامر (ISFP)",
          "المبدع (ISTP)"
        ],
        "ChallengingConnections": [
          "المحامي (INFJ)",
          "المهندس المعماري (INTJ)",
          "الوسيط (INFP)",
          "البطل (ENFJ)",
          "المفكر (INTP)",
          "القائد (ENTJ)",
          "اللوجستي (ISTJ)"
        ],
        "AttractedBy": [
          "مرح",
          "اجتماعي",
          "صادق",
          "دافئ",
          "يمكن الاعتماد عليه",
          "مسؤول",
          "أصيل",
          "ملتزم",
          "مغامر",
          "عملي",
          "واقعي",
          "دقيق"
        ],
        "PetPeeves": [
          "عاطفي بشكل مفرط",
          "غير موثوق",
          "متقلب",
          "متلاعب",
          "متأخر",
          "غير متوقع",
          "غير مسؤول",
          "غير منطقي",
          "غير صادق",
          "نمام",
          "تطفلي",
          "غير منظم",
          "سلبي عدائي"
        ],
        "HowToBeCompanion": [
          "كن موثوقًا ومتسقًا؛ يقدرون الأشخاص الذين يمكنهم الاعتماد عليهم.",
          "احترم روتينهم وخططهم؛ التغييرات المفاجئة يمكن أن تكون مزعجة لهم.",
          "أظهر حبك من خلال الأفعال العملية والملموسة.",
          "كن صادقًا ومباشرًا؛ يقدرون النزاهة فوق كل شيء.",
          "امنحهم المساحة لقضاء وقتهم بمفردهم، لكن ذكرهم أنك دائمًا موجود لهم.",
          "أظهر ولاءك، وسيكونون مخلصين في المقابل."
        ],
        "SecretDesire": "على الرغم من أن اللوجستيين يبدون منظمين وتقليديين، إلا أنهم في بعض الأحيان يتوقون إلى العفوية والمغامرة. في الخفاء، قد يستكشفون أفكارًا جديدة أو يتخيلون سيناريوهات مختلفة. على الرغم من أن هذا الجانب قد يكون مخفيًا عن معظم الناس، إلا أن الأصدقاء المقربين قد يشهدون طبيعتهم الغريبة والمتميزة. رغم ذلك، عادة ما يعودون إلى شخصيتهم الأكثر توقعًا ومسؤولية.",
        "Stereotype": "غالبًا ما يُنظر إلى اللوجستيين على أنهم مهووسون بالقواعد واللوائح، ويفتقرون إلى العمق العاطفي. ومع ذلك، وراء مظهرهم المتحفظ، يوجد قلب عطوف، خاصة تجاه أولئك الذين يحبونهم. على الرغم من أنهم قد لا يظهرون ذلك دائمًا، إلا أن اللوجستيين هم النوع الذي يقف بجانب أحبائهم، مقدماً الدعم الثابت والموثوقية في كل الظروف.",
        "Celebrities": [
          "جورج واشنطن",
          "الملكة إليزابيث الثانية",
          "هنري فورد",
          "جيف بيزوس",
          "إيفاندر هوليفيلد",
          "جوليا روبرتس",
          "دينزل واشنطن",
          "مورغان فريمان",
          "وارن بافيت",
          "ناتالي بورتمان",
          "روبرت دي نيرو"
        ]
      }      
    ]
  }  